uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_sdmmc.c
/****************************************************************************
 * arch/risc-v/src/esp32p4/esp32p4_sdmmc.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <inttypes.h>
#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <assert.h>
#include <debug.h>
#include <syslog.h>
#include "esp_cpu.h"
#include <errno.h>

#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/wdog.h>
#include <nuttx/clock.h>
#include <nuttx/sdio.h>
#include <nuttx/wqueue.h>
#include <nuttx/semaphore.h>
#include <nuttx/spinlock.h>
#include <nuttx/mmcsd.h>

#include "riscv_internal.h"
#include "esp_gpio.h"
#include "esp_irq_p4.h"
#include "esp32p4_sdmmc.h"

#include "soc/gpio_sig_map.h"
#include "soc/interrupts.h"

/* The SDMMC clock tree (SDIO PLL power-up in the PMU, bus clock, module
 * reset, LS clock source/divider) spans the PMU, LP_AON_CLKRST and
 * HP_SYS_CLKRST blocks; use the HAL's authoritative sequence rather than
 * open-coding it.
 */

#include "hal/sdmmc_ll.h"
#include "hal/cache_ll.h"
#include "soc/cache_reg.h"
#include "esp_private/periph_ctrl.h"
#include "esp_ldo_regulator.h"
#include <nuttx/mutex.h>

#ifdef CONFIG_ESP32P4_SDMMC_DMA
#  define ESP32P4_NC_ADDR(p) \
          ((uintptr_t)(p) + SOC_NON_CACHEABLE_OFFSET_SRAM)
#endif

#ifdef CONFIG_ESP32P4_SDMMC_DMA
#include "esp_cache.h"
#endif

#ifdef CONFIG_ESP32P4_SDMMC

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define MCI_DMADES0_OWN         (1UL << 31)
#define MCI_DMADES0_CH          (1 << 4)
#define MCI_DMADES0_FS          (1 << 3)
#define MCI_DMADES0_LD          (1 << 2)
#define MCI_DMADES0_DIC         (1 << 1)
#define MCI_DMADES1_MAXTR       4096
#define MCI_DMADES1_BS1(x)      (x)

/* GPIO matrix constant-level input sources (see esp_gpio_matrix_in) */

#define GPIO_MATRIX_CONST_ONE_INPUT   (0x38)
#define GPIO_MATRIX_CONST_ZERO_INPUT  (0x3c)

/* Timing : 100mS short timeout, 2 seconds for long one */

#define SDCARD_CMDTIMEOUT       MSEC2TICK(100)
#define SDCARD_LONGTIMEOUT      MSEC2TICK(2000)

/* FIFO size in bytes */

#define ESP32P4_TXFIFO_SIZE     (ESP32P4_TXFIFO_DEPTH | ESP32P4_TXFIFO_WIDTH)
#define ESP32P4_RXFIFO_SIZE     (ESP32P4_RXFIFO_DEPTH | ESP32P4_RXFIFO_WIDTH)

/* Number of DMA Descriptors */

#define ESP32P4_MULTIBLOCK_LIMIT  128
#define NUM_DMA_DESCRIPTORS \
        (1 + (ESP32P4_MULTIBLOCK_LIMIT * 512 / MCI_DMADES1_MAXTR))

#if (CONFIG_MMCSD_MULTIBLOCK_LIMIT == 0 || \
     CONFIG_MMCSD_MULTIBLOCK_LIMIT > ESP32P4_MULTIBLOCK_LIMIT)
#error "CONFIG_MMCSD_MULTIBLOCK_LIMIT is too big"
#endif

/* Data transfer interrupt mask bits */

#define SDCARD_RECV_MASK    (SDMMC_INT_DTO | SDMMC_INT_DCRC | SDMMC_INT_DRTO | \
                             SDMMC_INT_EBE | SDMMC_INT_RXDR | SDMMC_INT_SBE)
#define SDCARD_SEND_MASK    (SDMMC_INT_DTO | SDMMC_INT_DCRC | SDMMC_INT_DRTO | \
                             SDMMC_INT_EBE | SDMMC_INT_TXDR | SDMMC_INT_SBE)

#define SDCARD_DMARECV_MASK (SDMMC_INT_DTO | SDMMC_INT_DCRC | SDMMC_INT_DRTO | \
                             SDMMC_INT_SBE | SDMMC_INT_EBE)
#define SDCARD_DMASEND_MASK (SDMMC_INT_DTO | SDMMC_INT_DCRC | SDMMC_INT_DRTO | \
                             SDMMC_INT_EBE)

#define SDCARD_DMAERROR_MASK (SDMMC_IDINTEN_FBE | SDMMC_IDINTEN_DU | \
                              SDMMC_IDINTEN_AIS)

#define SDCARD_TRANSFER_ALL (SDMMC_INT_DTO | SDMMC_INT_DCRC | SDMMC_INT_DRTO | \
                             SDMMC_INT_EBE | SDMMC_INT_TXDR | SDMMC_INT_RXDR | \
                             SDMMC_INT_SBE)

/* Event waiting interrupt mask bits */

#define SDCARD_INT_RESPERR  (SDMMC_INT_RE | SDMMC_INT_RCRC | SDMMC_INT_RTO)

#ifdef CONFIG_MMCSD_HAVE_CARDDETECT
#  define SDCARD_INT_CDET    SDMMC_INT_CDET
#else
#  define SDCARD_INT_CDET    0
#endif

#define SDCARD_CMDDONE_STA   (SDMMC_INT_CDONE)

#define SDCARD_CMDDONE_MASK  (SDMMC_INT_CDONE)
#define SDCARD_RESPDONE_MASK (SDMMC_INT_CDONE | SDCARD_INT_RESPERR)
#define SDCARD_XFRDONE_MASK  (0)

#define SDCARD_CMDDONE_CLEAR  (SDMMC_INT_CDONE)
#define SDCARD_RESPDONE_CLEAR (SDMMC_INT_CDONE | SDCARD_INT_RESPERR)

#define SDCARD_XFRDONE_CLEAR  (SDCARD_TRANSFER_ALL)

#define SDCARD_WAITALL_CLEAR (SDCARD_CMDDONE_CLEAR | SDCARD_RESPDONE_CLEAR | \
                              SDCARD_XFRDONE_CLEAR)

/* Let's wait until we have both SD card transfer complete and DMA
 * complete.
 */

#define SDCARD_XFRDONE_FLAG  (1)
#define SDCARD_DMADONE_FLAG  (2)
#define SDCARD_ALLDONE       (3)

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct aligned_data(64) sdmmc_dma_s
{
  volatile uint32_t des0;        /* Control and status */
  volatile uint32_t des1;        /* Buffer size(s) */
  volatile uint32_t des2;        /* Buffer address pointer 1 */
  volatile uint32_t des3;        /* Next descriptor (chained) */
  uint32_t reserved[12];         /* Pad to 64B (P4 L1 cache line) */
};

/* This structure lists GPIO Matrix signal numbers for the SD bus signals.
 * Field names match SD bus signal names.
 */

typedef struct
{
  uint8_t clk;
  uint8_t cmd;
  uint8_t d0;
  uint8_t d1;
  uint8_t d2;
  uint8_t d3;
  uint8_t d4;
  uint8_t d5;
  uint8_t d6;
  uint8_t d7;
} sdmmc_slot_io_info_t;

