uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_sdmmc.c
/* Common SDMMC slot info (card detect / write protect / card interrupt) */

typedef struct
{
  uint8_t card_detect;    /* Card detect signal in GPIO Matrix */
  uint8_t write_protect;  /* Write protect signal in GPIO Matrix */
  uint8_t card_int;       /* Card interrupt signal in GPIO Matrix */
} sdmmc_slot_info_t;

/* This structure defines the state of the ESP32-P4 SDIO interface */

struct esp32p4_dev_s
{
  struct sdio_dev_s  dev;             /* Standard, base SDIO interface */

  /* ESP32-P4-specific extensions */

  /* Event support */

  sem_t              waitsem;         /* Implements event waiting */
  sdio_eventset_t    waitevents;      /* Set of events to be waited for */
  uint32_t           waitmask;        /* Interrupt enables for event wait */
  volatile sdio_eventset_t wkupevent; /* The event that caused the wakeup */
  struct wdog_s      waitwdog;        /* Event-timeout watchdog */

  /* Callback support */

  sdio_statset_t     cdstatus;        /* Card status */
  sdio_eventset_t    cbevents;        /* Set of events to cause callbacks */
  worker_t           callback;        /* Registered callback function */
  void              *cbarg;           /* Registered callback argument */
  struct work_s      cbwork;          /* Callback work queue structure */

  /* Interrupt mode data transfer support */

  uint32_t          *buffer;          /* Address of current R/W buffer */
  size_t             remaining;       /* Bytes remaining in the transfer */
  uint32_t           xfrmask;         /* Interrupt enables for data xfr */
#ifdef CONFIG_ESP32P4_SDMMC_DMA
  uint32_t           dmamask;         /* Interrupt enables for DMA xfr */
  uint8_t           *dmarxbuf;        /* DMA receive buffer, for post-xfr
                                       * cache invalidate */
  size_t             dmarxlen;        /* Length of dmarxbuf */
  volatile struct sdmmc_dma_s dma_desc[NUM_DMA_DESCRIPTORS];
#endif
  bool               wrdir;           /* True: Writing False: Reading */

  /* DMA data transfer support */

  int                slot;            /* SDMMC slot number */
  int                cpuint;          /* Allocated CPU interrupt */
  uint32_t           timeout_reg;     /* Per-card timeout in shared mode */

  const sdmmc_slot_io_info_t *sdio_pins;
  const sdmmc_slot_info_t *slot_info;
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* #define CONFIG_ESP32P4_SDMMC_REGDEBUG */

#ifdef CONFIG_ESP32P4_SDMMC_REGDEBUG
static uint32_t __esp32p4_getreg(const char *func, uint32_t addr);
static void __esp32p4_putreg(const char *func, uint32_t val, uint32_t addr);

#  define esp32p4_getreg(addr)     __esp32p4_getreg(__func__, addr)
#  define esp32p4_putreg(val,addr) __esp32p4_putreg(__func__, val,addr)
#else
#  define esp32p4_getreg(addr)     getreg32(addr)
#  define esp32p4_putreg(val,addr) putreg32(val,addr)
#endif

/* Data Transfer Helpers ****************************************************/

static void esp32p4_eventtimeout(wdparm_t arg);

static volatile uint32_t g_sdmmc_isr_count;
static volatile uint32_t g_sdmmc_isr_last;
static void esp32p4_endwait(struct esp32p4_dev_s *priv,
                            sdio_eventset_t wkupevent);
static void esp32p4_endtransfer(struct esp32p4_dev_s *priv,
                                sdio_eventset_t wkupevent);
static void esp32p4_drain_fifo(struct esp32p4_dev_s *priv);

/* Interrupt Handling *******************************************************/

static int  esp32p4_interrupt(int irq, void *context, void *arg);

/* SDIO interface methods ***************************************************/

/* Mutual exclusion */

#ifdef CONFIG_SDIO_MUXBUS
static int esp32p4_lock(struct sdio_dev_s *dev, bool lock);
#endif

/* Initialization/setup */

static void esp32p4_reset(struct sdio_dev_s *dev);
static sdio_capset_t esp32p4_capabilities(struct sdio_dev_s *dev);
static sdio_statset_t esp32p4_status(struct sdio_dev_s *dev);
static void esp32p4_widebus(struct sdio_dev_s *dev, bool enable);
static void esp32p4_clock(struct sdio_dev_s *dev, enum sdio_clock_e rate);
static int  esp32p4_attach(struct sdio_dev_s *dev);

/* Command/Status/Data Transfer */

static int  esp32p4_sendcmd(struct sdio_dev_s *dev, uint32_t cmd,
                            uint32_t arg);
#ifdef CONFIG_SDIO_BLOCKSETUP
static void esp32p4_blocksetup(struct sdio_dev_s *dev, unsigned int blocklen,
                               unsigned int nblocks);
#endif
static int  esp32p4_recvsetup(struct sdio_dev_s *dev, uint8_t *buffer,
                              size_t nbytes);
static int  esp32p4_sendsetup(struct sdio_dev_s *dev, const uint8_t *buffer,
                              size_t nbytes);
static int  esp32p4_cancel(struct sdio_dev_s *dev);

static int  esp32p4_waitresponse(struct sdio_dev_s *dev, uint32_t cmd);
static int  esp32p4_recvshortcrc(struct sdio_dev_s *dev, uint32_t cmd,
                                 uint32_t *rshort);
static int  esp32p4_recvlong(struct sdio_dev_s *dev, uint32_t cmd,
                             uint32_t rlong[4]);
static int  esp32p4_recvshort(struct sdio_dev_s *dev, uint32_t cmd,
                              uint32_t *rshort);

/* EVENT handler */

static void esp32p4_waitenable(struct sdio_dev_s *dev,
                               sdio_eventset_t eventset, uint32_t timeout);
static sdio_eventset_t esp32p4_eventwait(struct sdio_dev_s *dev);
static void esp32p4_callbackenable(struct sdio_dev_s *dev,
                                   sdio_eventset_t eventset);
static int  esp32p4_registercallback(struct sdio_dev_s *dev,
                                     worker_t callback, void *arg);

/* DMA */

#ifdef CONFIG_ESP32P4_SDMMC_DMA
static int  esp32p4_dmarecvsetup(struct sdio_dev_s *dev, uint8_t *buffer,
                                 size_t buflen);
static int  esp32p4_dmasendsetup(struct sdio_dev_s *dev,
                                 const uint8_t *buffer, size_t buflen);
#endif

/* Initialization/uninitialization/reset ************************************/

static void esp32p4_callback(void *arg);

/****************************************************************************
 * Private Data
 ****************************************************************************/

struct esp32p4_dev_s g_sdiodev =
{
  .dev =
  {
#ifdef CONFIG_SDIO_MUXBUS
    .lock             = esp32p4_lock,
#endif
    .reset            = esp32p4_reset,
    .capabilities     = esp32p4_capabilities,
    .status           = esp32p4_status,
    .widebus          = esp32p4_widebus,
    .clock            = esp32p4_clock,
    .attach           = esp32p4_attach,
    .sendcmd          = esp32p4_sendcmd,
#ifdef CONFIG_SDIO_BLOCKSETUP
    .blocksetup       = esp32p4_blocksetup,
#endif
    .recvsetup        = esp32p4_recvsetup,
    .sendsetup        = esp32p4_sendsetup,
    .cancel           = esp32p4_cancel,
    .waitresponse     = esp32p4_waitresponse,
    .recv_r1          = esp32p4_recvshortcrc,
    .recv_r2          = esp32p4_recvlong,
    .recv_r3          = esp32p4_recvshort,
    .recv_r4          = esp32p4_recvshort,
    .recv_r5          = esp32p4_recvshortcrc,
    .recv_r6          = esp32p4_recvshortcrc,
    .recv_r7          = esp32p4_recvshort,
    .waitenable       = esp32p4_waitenable,
    .eventwait        = esp32p4_eventwait,
    .callbackenable   = esp32p4_callbackenable,
    .registercallback = esp32p4_registercallback,
#ifdef CONFIG_ESP32P4_SDMMC_DMA
    .dmarecvsetup     = esp32p4_dmarecvsetup,
    .dmasendsetup     = esp32p4_dmasendsetup,
#endif
  },
  .waitsem = SEM_INITIALIZER(0),
};

#ifdef CONFIG_ESP32P4_SDMMC_SHARED_POLLED
static struct esp32p4_dev_s g_slots[2];
static bool g_slot_initialized[2];
static bool g_host_initialized;
static volatile bool g_host_fault;
static rmutex_t g_host_lock = NXRMUTEX_INITIALIZER;
static unsigned int g_host_depth;
static struct esp32p4_dev_s *g_active_slot;
#endif

/* Common SDMMC slot info.  Index 0 is slot 0, index 1 is slot 1.  The
 * numeric constants come from soc/gpio_sig_map.h (hw_ver3): the "_1_"
 * signals belong to slot 0 and the "_2_" signals to slot 1.
 */

static const sdmmc_slot_info_t g_sdmmc_slot_info[] =
{
  {
    .card_detect   = SD_CARD_DETECT_N_1_PAD_IN_IDX,
    .write_protect = SD_CARD_WRITE_PRT_1_PAD_IN_IDX,
    .card_int      = SD_CARD_INT_N_1_PAD_IN_IDX,
  },

  {
    .card_detect   = SD_CARD_DETECT_N_2_PAD_IN_IDX,
    .write_protect = SD_CARD_WRITE_PRT_2_PAD_IN_IDX,
    .card_int      = SD_CARD_INT_N_2_PAD_IN_IDX,
  }
};

