uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_sdmmc.c
/* GPIO Matrix signal indices for the SD bus signals.  On the P4 slot 0 is
 * IOMUX-only (no GPIO-matrix signals), so only slot 1 is populated; the
 * C6 SDIO link uses slot 1.  IN and OUT signal indices are equal on the P4
 * (e.g. SD_CARD_CCMD_2_PAD_IN_IDX == SD_CARD_CCMD_2_PAD_OUT_IDX), so the
 * OUT index is stored and reused for the matrix-in routing.
 */

static const sdmmc_slot_io_info_t g_sdmmc_slot_gpio_sig[] =
{
  {
    .clk = 0,
    .cmd = 0,
    .d0  = 0,
    .d1  = 0,
    .d2  = 0,
    .d3  = 0,
    .d4  = 0,
    .d5  = 0,
    .d6  = 0,
    .d7  = 0,
  },

  {
    .clk = SD_CARD_CCLK_2_PAD_OUT_IDX,
    .cmd = SD_CARD_CCMD_2_PAD_OUT_IDX,
    .d0  = SD_CARD_CDATA0_2_PAD_OUT_IDX,
    .d1  = SD_CARD_CDATA1_2_PAD_OUT_IDX,
    .d2  = SD_CARD_CDATA2_2_PAD_OUT_IDX,
    .d3  = SD_CARD_CDATA3_2_PAD_OUT_IDX,
    .d4  = SD_CARD_CDATA4_2_PAD_OUT_IDX,
    .d5  = SD_CARD_CDATA5_2_PAD_OUT_IDX,
    .d6  = SD_CARD_CDATA6_2_PAD_OUT_IDX,
    .d7  = SD_CARD_CDATA7_2_PAD_OUT_IDX,
  }
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32p4_getreg
 *
 * Description:
 *   This function may be used to intercept and monitor register accesses.
 *   Clearly this is nothing you would want to do unless you are debugging
 *   this driver.
 *
 * Input Parameters:
 *   addr - The register address to read
 *
 * Returned Value:
 *   The value read from the register
 *
 ****************************************************************************/

#ifdef CONFIG_ESP32P4_SDMMC_REGDEBUG
static uint32_t __esp32p4_getreg(const char *func, uint32_t addr)
{
  static uint32_t prevaddr = 0;
  static uint32_t preval   = 0;
  static uint32_t count    = 0;

  /* Read the value from the register */

  uint32_t val = getreg32(addr);

  /* Is this the same value that we read from the same register last time?
   * Are we polling the register?  If so, suppress some of the output.
   */

  if (addr == prevaddr && val == preval)
    {
      if (count == 0xffffffff || ++count > 3)
        {
          if (count == 4)
            {
              mcerr("%s: ...\n", func);
            }

          return val;
        }
    }

  /* No this is a new address or value */

  else
    {
      /* Did we print "..." for the previous value? */

      if (count > 3)
        {
          /* Yes.. then show how many times the value repeated */

          mcerr("%s: [repeats %d more times]\n", func, count - 3);
        }

      /* Save the new address, value, and count */

      prevaddr = addr;
      preval   = val;
      count    = 1;
    }

  /* Show the register value read */

  mcerr("%s: %08x->%08x\n", func, addr, val);
  return val;
}
#endif

/****************************************************************************
 * Name: esp32p4_putreg
 *
 * Description:
 *   This function may be used to intercept and monitor register accesses.
 *   Clearly this is nothing you would want to do unless you are debugging
 *   this driver.
 *
 * Input Parameters:
 *   val  - The value to write to the register
 *   addr - The register address to read
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_ESP32P4_SDMMC_REGDEBUG
static void __esp32p4_putreg(const char *func, uint32_t val, uint32_t addr)
{
  /* Show the register value being written */

  mcerr("%s: %08x<-%08x\n", func, addr, val);

  /* Write the value */

  putreg32(val, addr);
}
#endif

/****************************************************************************
 * Name: esp32p4_ciu_sendcmd
 *
 * Description:
 *   Function to send command to Card interface unit (CIU)
 *
 * Input Parameters:
 *   cmd - The command to be executed
 *   arg - The argument to use with the command.
 *
 * Returned Value:
 *   Returns zero on success.  One will be returned on a timeout.
 *
 ****************************************************************************/

static int esp32p4_ciu_sendcmd(uint32_t cmd, uint32_t arg)
{
  clock_t watchtime;

  watchtime = clock_systime_ticks();

  while ((esp32p4_getreg(ESP32P4_SDMMC_CMD) & SDMMC_CMD_STARTCMD) != 0)
    {
      if (clock_systime_ticks() - watchtime > SDCARD_CMDTIMEOUT)
        {
          mcerr("TMO Timed out (%08" PRIX32 ")\n",
                esp32p4_getreg(ESP32P4_SDMMC_CMD));
          return 1;
        }
    }

  /* Set command arg reg */

  cmd |= SDMMC_CMD_STARTCMD | SDMMC_CMD_USE_HOLE;

  esp32p4_putreg(arg, ESP32P4_SDMMC_CMDARG);
  esp32p4_putreg(cmd, ESP32P4_SDMMC_CMD);

  mcinfo("cmd=0x%" PRIx32 " arg=0x%" PRIx32 "\n", cmd, arg);

  return 0;
}

/****************************************************************************
 * Name: configure_pin
 *
 * Description:
 *   Configure one SD bus GPIO and route it through the P4 GPIO matrix.
 *
 ****************************************************************************/

static void configure_pin(int gpio_pin, uint8_t sdio_pin,
                          gpio_pinattr_t attr)
{
  /* Match ESP-IDF sdmmc configure_pin_gpio_matrix(): GPIO function,
   * pulldown off, drive strength 3.  Cancel any previous matrix output
   * before attaching the SDMMC signal so a leftover OE does not hold DAT
   * high (that produces SBE on a 4-bit read).
   */

  attr |= DRIVE_3;
  esp_gpio_matrix_out(gpio_pin, 0x100, false, false);
  esp_configgpio(gpio_pin, attr);

  if (attr & INPUT)
    {
      esp_gpio_matrix_in(gpio_pin, sdio_pin, false);
    }

  if (attr & OUTPUT)
    {
      esp_gpio_matrix_out(gpio_pin, sdio_pin, false, false);
    }
}

/****************************************************************************
 * Name: esp32p4_enable_ints
 *
 * Description:
 *   Enable/disable SD card interrupts per functional settings.
 *
 * Input Parameters:
 *   priv - A reference to the SD card device state structure
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void esp32p4_enable_ints(struct esp32p4_dev_s *priv)
{
  uint32_t regval;

#ifdef CONFIG_ESP32P4_SDMMC_DMA
  mcinfo("waitmask=%04lx xfrmask=%04lx dmamask=%04lx RINTSTS=%08lx\n",
         (unsigned long)priv->waitmask, (unsigned long)priv->xfrmask,
         (unsigned long)priv->dmamask,
         (unsigned long)esp32p4_getreg(ESP32P4_SDMMC_RINTSTS));
#else
  mcinfo("waitmask=%04lx xfrmask=%04lx RINTSTS=%08lx\n",
         (unsigned long)priv->waitmask, (unsigned long)priv->xfrmask,
         (unsigned long)esp32p4_getreg(ESP32P4_SDMMC_RINTSTS));
#endif

