uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_sdmmc.c
  /* Enable SDMMC interrupts */

  regval = priv->xfrmask | priv->waitmask | SDCARD_INT_CDET;
  esp32p4_putreg(regval, ESP32P4_SDMMC_INTMASK);
}

/****************************************************************************
 * Name: esp32p4_disable_allints
 *
 * Description:
 *   Disable all SD card interrupts.
 *
 * Input Parameters:
 *   priv - A reference to the SD card device state structure
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void esp32p4_disable_allints(struct esp32p4_dev_s *priv)
{
#ifdef CONFIG_ESP32P4_SDMMC_DMA
  /* Disable DMA-related interrupts */

  priv->dmamask = 0;
#endif

  /* Disable all SDMMC interrupts (except card detect) */

  esp32p4_putreg(SDCARD_INT_CDET, ESP32P4_SDMMC_INTMASK);
  priv->waitmask = 0;
  priv->xfrmask  = 0;
}

/****************************************************************************
 * Name: esp32p4_config_waitints
 *
 * Description:
 *   Enable/disable SD card interrupts needed to support the wait function
 *
 * Input Parameters:
 *   priv       - A reference to the SD card device state structure
 *   waitmask   - The set of bits in the SD card INTMASK register to set
 *   waitevents - Waited for events
 *   wkupevent  - Wake-up events
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void esp32p4_config_waitints(struct esp32p4_dev_s *priv,
                                    uint32_t waitmask,
                                    sdio_eventset_t waitevents,
                                    sdio_eventset_t wkupevent)
{
  irqstate_t flags;

  mcinfo("waitevents=%04x wkupevent=%04x\n",
         (unsigned)waitevents, (unsigned)wkupevent);

  /* Save all of the data and set the new interrupt mask in one, atomic
   * operation.
   */

  flags            = enter_critical_section();
  priv->waitevents = waitevents;
  priv->wkupevent  = wkupevent;
  priv->waitmask   = waitmask;

  esp32p4_enable_ints(priv);
  leave_critical_section(flags);
}

/****************************************************************************
 * Name: esp32p4_config_xfrints
 *
 * Description:
 *   Enable SD card interrupts needed to support the data transfer event
 *
 * Input Parameters:
 *   priv    - A reference to the SD card device state structure
 *   xfrmask - The set of bits in the SD card MASK register to set
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void esp32p4_config_xfrints(struct esp32p4_dev_s *priv,
                                   uint32_t xfrmask)
{
  irqstate_t flags;
  flags = enter_critical_section();

  priv->xfrmask = xfrmask;
  esp32p4_enable_ints(priv);

  leave_critical_section(flags);
}

/****************************************************************************
 * Name: esp32p4_config_dmaints
 *
 * Description:
 *   Enable DMA transfer interrupts
 *
 * Input Parameters:
 *   priv    - A reference to the SD card device state structure
 *   xfrmask - The set of bits in the SD card MASK register to set
 *   dmamask - The set of bits in the DMA MASK register to set
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_ESP32P4_SDMMC_DMA
static void esp32p4_config_dmaints(struct esp32p4_dev_s *priv,
                                   uint32_t xfrmask, uint32_t dmamask)
{
  irqstate_t flags;
  flags = enter_critical_section();

  priv->xfrmask = xfrmask;
  priv->dmamask = dmamask;
  esp32p4_enable_ints(priv);

  leave_critical_section(flags);
}
#endif

/****************************************************************************
 * Name: esp32p4_eventtimeout
 *
 * Description:
 *   The watchdog timeout setup when the event wait start has expired
 *   without any other waited-for event occurring.
 *
 * Input Parameters:
 *   arg    - The argument
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Always called from the interrupt level with interrupts disabled.
 *
 ****************************************************************************/

static void esp32p4_eventtimeout(wdparm_t arg)
{
  struct esp32p4_dev_s *priv = (struct esp32p4_dev_s *)arg;

  /* There is always race conditions with timer expirations. */

  DEBUGASSERT((priv->waitevents & SDIOWAIT_TIMEOUT) != 0 ||
              priv->wkupevent != 0);

  /* In polled mode the owner can be preempted after hardware finishes.
   * Service the actual latched completion/errors before declaring a software
   * deadline failure.  The transaction lock still excludes the other slot.
   */

#ifdef CONFIG_ESP32P4_SDMMC_SHARED_POLLED
  if (g_active_slot == priv && priv->remaining &&
      esp32p4_getreg(ESP32P4_SDMMC_MINTSTS) != 0)
    {
      esp32p4_interrupt(0, NULL, priv);
      if (priv->wkupevent != 0)
        {
          syslog(LOG_INFO, "SDMMC: watchdog serviced latched event "
                 "slot=%d event=0x%x\n",
                 priv->slot, priv->wkupevent);
          return;
        }
    }
#endif

  /* Is a data transfer complete event expected? */

  if ((priv->waitevents & SDIOWAIT_TIMEOUT) != 0)
    {
      /* Yes.. wake up any waiting threads */

#ifdef CONFIG_ESP32P4_SDMMC_SHARED_POLLED
      g_host_fault = true;
#endif

      esp32p4_endwait(priv, SDIOWAIT_TIMEOUT);
      syslog(LOG_ERR,
             "SDMMCPROBE: timeout remaining=%d isr_count=%lu "
             "isr_last=0x%08lx\n"
             "SDMMCPROBE: CTRL=0x%08lx INTMASK=0x%08lx MINTSTS=0x%08lx "
             "RINTSTS=0x%08lx\n"
             "SDMMCPROBE: STATUS=0x%08lx IDSTS=0x%08lx IDINTEN=0x%08lx "
             "BYTCNT=0x%08lx BLKSIZ=0x%08lx\n"
             "SDMMCPROBE: cpuint=%d clic_en=0x%08lx\n",
             priv->remaining,
             (unsigned long)g_sdmmc_isr_count,
             (unsigned long)g_sdmmc_isr_last,
             (unsigned long)esp32p4_getreg(ESP32P4_SDMMC_CTRL),
             (unsigned long)esp32p4_getreg(ESP32P4_SDMMC_INTMASK),
             (unsigned long)esp32p4_getreg(ESP32P4_SDMMC_MINTSTS),
             (unsigned long)esp32p4_getreg(ESP32P4_SDMMC_RINTSTS),
             (unsigned long)esp32p4_getreg(ESP32P4_SDMMC_STATUS),
             (unsigned long)esp32p4_getreg(ESP32P4_SDMMC_IDSTS),
             (unsigned long)esp32p4_getreg(ESP32P4_SDMMC_IDINTEN),
             (unsigned long)esp32p4_getreg(ESP32P4_SDMMC_BYTCNT),
             (unsigned long)esp32p4_getreg(ESP32P4_SDMMC_BLKSIZ),
             priv->cpuint,
             (unsigned long)esp_cpu_intr_get_enabled_mask());
    }
}

/****************************************************************************
 * Name: esp32p4_endwait
 *
 * Description:
 *   Wake up a waiting thread if the waited-for event has occurred.
 *
 * Input Parameters:
 *   priv      - An instance of the SDIO device interface
 *   wkupevent - The event that caused the wait to end
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Always called from the interrupt level with interrupts disabled.
 *
 ****************************************************************************/

static void esp32p4_endwait(struct esp32p4_dev_s *priv,
                            sdio_eventset_t wkupevent)
{
  mcinfo("wkupevent=%04x\n", (unsigned)wkupevent);

  /* Cancel the watchdog timeout */

