uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_sdmmc.c
  wd_cancel(&priv->waitwdog);

  /* Disable event-related interrupts */

  esp32p4_config_waitints(priv, 0, 0, wkupevent);

  /* Wake up the waiting thread */

  nxsem_post(&priv->waitsem);
}

/****************************************************************************
 * Name: esp32p4_endtransfer
 *
 * Description:
 *   Terminate a transfer with the provided status.  This function is called
 *   only from the SDIO interrupt handler when end-of-transfer conditions
 *   are detected.
 *
 * Input Parameters:
 *   priv      - An instance of the SDIO device interface
 *   wkupevent - The event that caused the transfer to end
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Always called from the interrupt level with interrupts disabled.
 *
 ****************************************************************************/

static void esp32p4_drain_fifo(struct esp32p4_dev_s *priv)
{
  unsigned int before;
  unsigned int now;
  unsigned int next;
  uint32_t word;
  int i;

  if (priv->wrdir || priv->buffer == NULL || priv->remaining == 0)
    {
      return;
    }

  before = SDMMC_STATUS_FIFOCOUNT(esp32p4_getreg(ESP32P4_SDMMC_STATUS));

  for (i = 0; priv->remaining > 0; i++)
    {
      now = SDMMC_STATUS_FIFOCOUNT(esp32p4_getreg(ESP32P4_SDMMC_STATUS));
      if (now == 0)
        {
          break;
        }

      word = getreg32(ESP32P4_SDMMC_DATA);
      next = SDMMC_STATUS_FIFOCOUNT(esp32p4_getreg(ESP32P4_SDMMC_STATUS));

      /* Same-address reads did not pop the P4 FIFO (count stayed at the
       * programmed word count and the first word repeated).  Walk the
       * 0x200-0x3fc window; some DW ports decode any address in that
       * range as a FIFO pop.
       */

      if (next == now)
        {
          word = getreg32(ESP32P4_SDMMC_DATA + ((i * 4) & 0x1fc));
          next = SDMMC_STATUS_FIFOCOUNT(
                   esp32p4_getreg(ESP32P4_SDMMC_STATUS));
        }

      if (i < 6)
        {
          syslog(LOG_INFO,
                 "SDMMCPROBE: fifo[%d] %u->%u word=0x%08lx\n",
                 i, now, next, (unsigned long)word);
        }

      *priv->buffer++ = word;
      priv->remaining -= 4;

      if (next == now)
        {
          syslog(LOG_ERR,
                 "SDMMCPROBE: FIFO read does not pop (count=%u)\n", now);
          break;
        }
    }

  UNUSED(before);
  UNUSED(i);
}

static void esp32p4_endtransfer(struct esp32p4_dev_s *priv,
                                sdio_eventset_t wkupevent)
{
#ifdef CONFIG_ESP32P4_SDMMC_SHARED_POLLED
  if (wkupevent & (SDIOWAIT_ERROR | SDIOWAIT_TIMEOUT)) g_host_fault = true;
#endif
  mcinfo("wkupevent=%04x\n", (unsigned)wkupevent);

  /* Disable all transfer related interrupts */

  esp32p4_config_xfrints(priv, 0);

  /* Clearing pending interrupt status on all transfer related interrupts */

  esp32p4_putreg(priv->waitmask, ESP32P4_SDMMC_RINTSTS);

  /* Mark the transfer finished */

  priv->remaining = 0;

  /* Is a thread wait for these data transfer complete events? */

  if ((priv->waitevents & wkupevent) != 0)
    {
      /* Yes.. wake up any waiting threads */

      esp32p4_endwait(priv, wkupevent);
    }
}

/****************************************************************************
 * Name: esp32p4_interrupt
 *
 * Description:
 *   SDIO interrupt handler
 *
 * Input Parameters:
 *   irq     - Interrupt number
 *   context - Saved interrupt context
 *   arg     - An instance of the SDIO device interface
 *
 * Returned Value:
 *   OK
 *
 ****************************************************************************/

static int esp32p4_interrupt(int irq, void *context, void *arg)
{
  struct esp32p4_dev_s *priv = arg;
  uint32_t enabled;
  uint32_t pending;

  g_sdmmc_isr_count++;
  g_sdmmc_isr_last = esp32p4_getreg(ESP32P4_SDMMC_MINTSTS);

  /* Loop while there are pending interrupts.  Check the SD card status
   * register.  Mask out all bits that don't correspond to enabled
   * interrupts.  (This depends on the fact that bits are ordered the same
   * in both the STA and MASK register).  If there are non-zero bits
   * remaining, then we have work to do here.
   */

  while ((enabled = esp32p4_getreg(ESP32P4_SDMMC_MINTSTS)) != 0)
    {
      /* Clear pending status */

      esp32p4_putreg(enabled, ESP32P4_SDMMC_RINTSTS);

#ifdef CONFIG_MMCSD_HAVE_CARDDETECT
      /* Handle in card detection events ************************************/

      if ((enabled & SDMMC_INT_CDET) != 0)
        {
          sdio_statset_t cdstatus;

          /* Update card status */

          cdstatus = priv->cdstatus;
          if ((esp32p4_getreg(ESP32P4_SDMMC_CDETECT) &
              SDMMC_CDETECT_NOTPRESENT(priv->slot)) == 0)
            {
              priv->cdstatus |= SDIO_STATUS_PRESENT;

#ifdef CONFIG_MMCSD_HAVE_WRITEPROTECT
              if ((esp32p4_getreg(ESP32P4_SDMMC_WRTPRT) &
                  SDMMC_WRTPRT_PROTECTED(priv->slot)) != 0)
                {
                  priv->cdstatus |= SDIO_STATUS_WRPROTECTED;
                }
              else
#endif
                {
                  priv->cdstatus &= ~SDIO_STATUS_WRPROTECTED;
                }
            }
          else
            {
              priv->cdstatus &=
                ~(SDIO_STATUS_PRESENT | SDIO_STATUS_WRPROTECTED);
            }

          mcinfo("cdstatus OLD: %02x NEW: %02x\n", cdstatus,
                 priv->cdstatus);

          /* Perform any requested callback if the status has changed */

          if (cdstatus != priv->cdstatus)
            {
              esp32p4_callback(priv);
            }
        }
#endif

      /* Handle data transfer events ****************************************/

      pending = enabled & priv->xfrmask;
      if (pending != 0)
        {
          /* Handle data request events */

          if ((pending & SDMMC_INT_TXDR) != 0)
            {
              uint32_t status;

              /* Transfer data to the TX FIFO */

              DEBUGASSERT(priv->wrdir);

              for (status = esp32p4_getreg(ESP32P4_SDMMC_STATUS);
                   (status & SDMMC_STATUS_FIFOFULL) == 0 &&
                   priv->remaining > 0;
                   status = esp32p4_getreg(ESP32P4_SDMMC_STATUS))
                {
                  esp32p4_putreg(*priv->buffer, ESP32P4_SDMMC_DATA);
                  priv->buffer++;
                  priv->remaining -= 4;
                }
            }
          else if ((pending & SDMMC_INT_RXDR) != 0)
            {
              DEBUGASSERT(!priv->wrdir);
              esp32p4_drain_fifo(priv);
            }

          /* Check for transfer errors.  DCRC often arrives with DTO on a
           * short hosted frame: finish the transfer so IDMAC can write back
           * instead of aborting first and flushing the FIFO.
           */

          if (priv->slot == 0 &&
              (pending & (SDMMC_INT_DCRC | SDMMC_INT_DRTO)) != 0)
            {
              /* C6-specific CRC/DTO tolerance must not mask card errors. */

              esp32p4_endtransfer(priv, SDIOWAIT_TRANSFERDONE |
                                  SDIOWAIT_ERROR);
            }
          else if ((pending & SDMMC_INT_DCRC) != 0 &&
              (pending & SDMMC_INT_DTO) == 0)
            {
#ifdef CONFIG_ESP32P4_SDMMC_DMA
              volatile struct sdmmc_dma_s *ncdesc;
              int spin;
#endif

              UNUSED(pending);

#ifdef CONFIG_ESP32P4_SDMMC_DMA
              /* Do not abort: IDMAC is often still in DESC_CLOSE with the
               * hosted payload sitting in the FIFO.  Wait for DTO / OWN.
               */

