uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_sdmmc.c
              ncdesc = (volatile struct sdmmc_dma_s *)
                       ESP32P4_NC_ADDR(&priv->dma_desc[0]);
              for (spin = 0; spin < 1000; spin++)
                {
                  uint32_t rint = esp32p4_getreg(ESP32P4_SDMMC_RINTSTS);
                  uint32_t idsts = esp32p4_getreg(ESP32P4_SDMMC_IDSTS);

                  if ((ncdesc->des0 & MCI_DMADES0_OWN) == 0 ||
                      (rint & SDMMC_INT_DTO) != 0 ||
                      ((idsts >> 10) & 0xf) == 0)
                    {
                      break;
                    }

                  esp32p4_putreg(1, ESP32P4_SDMMC_PLDMND);
                }

              UNUSED(spin);

              esp32p4_endtransfer(priv, SDIOWAIT_TRANSFERDONE);
#else
              esp32p4_drain_fifo(priv);
              esp32p4_endtransfer(priv,
                                  SDIOWAIT_TRANSFERDONE | SDIOWAIT_ERROR);
#endif
            }

          /* Handle data timeout error */

          else if ((pending & SDMMC_INT_DRTO) != 0 &&
                   (pending & SDMMC_INT_DTO) == 0)
            {
              syslog(LOG_ERR,
                     "SDMMCPROBE: DRTO pending=0x%08lx remaining=%d\n",
                     (unsigned long)pending, priv->remaining);

              esp32p4_endtransfer(priv,
                                  SDIOWAIT_TRANSFERDONE | SDIOWAIT_TIMEOUT);
            }

          /* Handle RX FIFO overrun error */

          else if ((pending & SDMMC_INT_FRUN) != 0)
            {
              syslog(LOG_ERR,
                     "SDMMCPROBE: FRUN pending=0x%08lx remaining=%d\n",
                     (unsigned long)pending, priv->remaining);

              esp32p4_endtransfer(priv,
                                  SDIOWAIT_TRANSFERDONE | SDIOWAIT_ERROR);
            }

          /* Handle start bit / end bit errors */

          else if ((pending & (SDMMC_INT_SBE | SDMMC_INT_EBE)) != 0)
            {
              syslog(LOG_ERR,
                     "SDMMCPROBE: SBE/EBE pending=0x%08lx remaining=%d\n",
                     (unsigned long)pending, priv->remaining);

              esp32p4_endtransfer(priv,
                                  SDIOWAIT_TRANSFERDONE | SDIOWAIT_ERROR);
            }

          /* Handle data end events.  Note that RXDR may accompany DTO, DTO
           * will be set on received while there is still data in the FIFO.
           * So for the case of receiving, we don't actually even enable the
           * DTO interrupt.
           */

          else if ((pending & SDMMC_INT_DTO) != 0)
            {
              /* DTO+DCRC is treated as transfer-complete on this 1-bit
               * hosted path; do not log it as an error on every CMD53.
               */

              esp32p4_drain_fifo(priv);
              esp32p4_endtransfer(priv, SDIOWAIT_TRANSFERDONE);
            }
        }

      /* Handle wait events *************************************************/

      pending = enabled & priv->waitmask;
      if (pending != 0)
        {
          /* Is this a response error event? */

          if ((pending & SDCARD_INT_RESPERR) != 0)
            {
              /* If response errors are enabled, then we must certainly be
               * waiting for a response.
               */

              DEBUGASSERT((priv->waitevents & SDIOWAIT_RESPONSEDONE) != 0);

              /* Wake the thread up */

              mcerr("ERROR: Response error, pending=%08" PRIx32 "\n",
                    pending);
              esp32p4_endwait(priv, SDIOWAIT_RESPONSEDONE | SDIOWAIT_ERROR);
            }

          /* Is this a command (plus response) completion event? */

          else if ((pending & SDMMC_INT_CDONE) != 0)
            {
              /* Yes.. Is their a thread waiting for response done? */

              if ((priv->waitevents & SDIOWAIT_RESPONSEDONE) != 0)
                {
                  /* Yes.. wake the thread up */

                  esp32p4_endwait(priv, SDIOWAIT_RESPONSEDONE);
                }

              /* NO.. Is their a thread waiting for command done? */

              else if ((priv->waitevents & SDIOWAIT_CMDDONE) != 0)
                {
                  /* Yes.. wake the thread up */

                  esp32p4_endwait(priv, SDIOWAIT_CMDDONE);
                }
            }
        }
    }

#ifdef CONFIG_ESP32P4_SDMMC_DMA
  /* DMA error events *******************************************************/

  pending = esp32p4_getreg(ESP32P4_SDMMC_IDSTS);
  if ((pending & priv->dmamask) != 0)
    {
      syslog(LOG_ERR, "SDMMCPROBE: IDSTS=0x%08lx dmamask=0x%08lx\n",
             (unsigned long)pending, (unsigned long)priv->dmamask);

      /* Clear the pending interrupts */

      esp32p4_putreg(pending, ESP32P4_SDMMC_IDSTS);

      /* Abort the transfer */

      esp32p4_endtransfer(priv, SDIOWAIT_TRANSFERDONE | SDIOWAIT_ERROR);
    }
#endif

  return OK;
}

/****************************************************************************
 * Name: esp32p4_lock
 *
 * Description:
 *   Locks the bus. Function calls low-level multiplexed bus routines to
 *   resolve bus requests and acknowledgment issues.
 *
 * Input Parameters:
 *   dev  - An instance of the SDIO device interface
 *   lock - TRUE to lock, FALSE to unlock.
 *
 * Returned Value:
 *   OK on success; a negated errno on failure
 *
 ****************************************************************************/

#ifdef CONFIG_SDIO_MUXBUS
static int esp32p4_lock(struct sdio_dev_s *dev, bool lock)
{
#ifdef CONFIG_ESP32P4_SDMMC_SHARED_POLLED
  struct esp32p4_dev_s *priv = (struct esp32p4_dev_s *)dev;
  int ret;
  int attempt;

  if (lock)
    {
      ret = nxrmutex_lock(&g_host_lock);
      if (ret < 0) return ret;
      if (g_host_fault || (g_host_depth && g_active_slot != priv))
        {
          nxrmutex_unlock(&g_host_lock);
          return -EIO;
        }

      if (g_host_depth++ == 0)
        {
          g_active_slot = priv;
          esp32p4_putreg(priv->timeout_reg, ESP32P4_SDMMC_TMOUT);
        }

      return OK;
    }

  if (!nxrmutex_is_hold(&g_host_lock) || !g_host_depth ||
      g_active_slot != priv) return -EPERM;
  if (--g_host_depth == 0)
    {
      /* Do not transfer a live command/data engine to another slot.  No
       * controller reset here: a failing client may still own DMA memory.
       */

      for (attempt = 0; attempt < 100; attempt++)
        {
          if (!(esp32p4_getreg(ESP32P4_SDMMC_CMD) & SDMMC_CMD_STARTCMD) &&
              !(esp32p4_getreg(ESP32P4_SDMMC_STATUS) &
                SDMMC_STATUS_DATAFSMBUSY)) break;
          up_udelay(1000);
        }

      if (attempt == 100 || priv->remaining != 0)
        {
          g_host_fault = true;
          syslog(LOG_ERR, "SDMMC shared: non-quiescent handoff; "
                 "reboot required\n");
        }
    }

  ret = nxrmutex_unlock(&g_host_lock);
  return g_host_fault ? -EIO : ret;
#else
  /* The multiplex bus is part of board support package. */

  return OK;
#endif
}
#endif

/****************************************************************************
 * Name: esp32p4_reset
 *
 * Description:
 *   Reset the SDIO controller.  Undo all setup and initialization.
 *
 * Input Parameters:
 *   dev - An instance of the SDIO device interface
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void esp32p4_reset(struct sdio_dev_s *dev)
{
  struct esp32p4_dev_s *priv = (struct esp32p4_dev_s *)dev;
  irqstate_t flags;
  uint32_t regval;

#ifdef CONFIG_ESP32P4_SDMMC_SHARED_POLLED
  if (g_host_initialized)
    {
      syslog(LOG_ERR, "SDMMC shared: live host reset refused; "
             "reboot required\n");
      return;
    }
#endif

