uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_sdmmc.c
  mcinfo("Resetting...\n");

  flags = enter_critical_section();

  /* Reset all blocks */

  esp32p4_putreg(SDMMC_CTRL_CNTLRRESET | SDMMC_CTRL_FIFORESET |
                 SDMMC_CTRL_DMARESET, ESP32P4_SDMMC_CTRL);

  regval = 1000000;
  while ((esp32p4_getreg(ESP32P4_SDMMC_CTRL) &
         (SDMMC_CTRL_CNTLRRESET | SDMMC_CTRL_FIFORESET |
          SDMMC_CTRL_DMARESET)) != 0)
    {
      if (--regval == 0)
        {
          mcerr("Controller reset timeout (no SDMMC clock?)\n");
          break;
        }
    }

  /* Select clock divider (slot N selects clock divider N).  Unlike the S3,
   * the LS clock source and host divider live in HP_SYS_CLKRST (set up in
   * esp32p4_sdmmc_sdio_initialize), so nothing is written to the SDMMC
   * 0x800 register here.
   */

  regval = esp32p4_getreg(ESP32P4_SDMMC_CLKSRC);
  regval &= ~SDMMC_CLKSRC_MASK(priv->slot);
  regval |= SDMMC_CLKSRC_CLKDIV(priv->slot, priv->slot);
  esp32p4_putreg(regval, ESP32P4_SDMMC_CLKSRC);

#ifdef CONFIG_ESP32P4_SDMMC_DMA
  /* Program the DMA descriptor list base address.
   *
   * NOTE: This uses the CPU address of the descriptor array.  On the P4 the
   * internal SRAM is DMA-capable and identity-mapped, but confirm on
   * hardware that no address translation is required for the IDMAC.
   */

  esp32p4_putreg((uint32_t)(uintptr_t)&priv->dma_desc[0],
                 ESP32P4_SDMMC_DBADDR);
#endif

  /* Reset data */

  priv->waitevents = 0;      /* Set of events to be waited for */
  priv->waitmask   = 0;      /* Interrupt enables for event waiting */
  priv->wkupevent  = 0;      /* The event that caused the wakeup */

  wd_cancel(&priv->waitwdog); /* Cancel any timeouts */

  /* Interrupt mode data transfer support */

  priv->buffer     = 0;      /* Address of current R/W buffer */
  priv->remaining  = 0;      /* Number of bytes remaining in the transfer */
  priv->xfrmask    = 0;      /* Interrupt enables for data transfer */
#ifdef CONFIG_ESP32P4_SDMMC_DMA
  priv->dmamask    = 0;      /* Interrupt enables for DMA transfer */
#endif

  /* DMA data transfer support */

  priv->cdstatus   = 0;      /* Card status is unknown */

  leave_critical_section(flags);
}

/****************************************************************************
 * Name: esp32p4_capabilities
 *
 * Description:
 *   Get capabilities (and limitations) of the SDIO driver (optional)
 *
 * Input Parameters:
 *   dev - Device-specific state data
 *
 * Returned Value:
 *   Returns a bitset of status values (see SDIO_CAPS_* defines)
 *
 ****************************************************************************/

static sdio_capset_t esp32p4_capabilities(struct sdio_dev_s *dev)
{
  sdio_capset_t caps = 0;

  caps |= SDIO_CAPS_DMABEFOREWRITE;
  caps |= SDIO_CAPS_MMC_HS_MODE;

#ifdef CONFIG_SDIO_WIDTH_D1_ONLY
  caps |= SDIO_CAPS_1BIT_ONLY;
#endif
#ifdef CONFIG_ESP32P4_SDMMC_DMA
  caps |= SDIO_CAPS_DMASUPPORTED;
#endif

  return caps;
}

/****************************************************************************
 * Name: esp32p4_status
 *
 * Description:
 *   Get SDIO status.
 *
 * Input Parameters:
 *   dev - Device-specific state data
 *
 * Returned Value:
 *   Returns a bitset of status values (see SDIO_STATUS_* defines)
 *
 ****************************************************************************/

static sdio_statset_t esp32p4_status(struct sdio_dev_s *dev)
{
  struct esp32p4_dev_s *priv = (struct esp32p4_dev_s *)dev;

#ifdef CONFIG_MMCSD_HAVE_CARDDETECT
  if ((esp32p4_getreg(ESP32P4_SDMMC_CDETECT) &
       SDMMC_CDETECT_NOTPRESENT(priv->slot)) == 0)
    {
      priv->cdstatus |= SDIO_STATUS_PRESENT;
    }
  else
    {
      priv->cdstatus &= ~SDIO_STATUS_PRESENT;
    }
#endif

  mcinfo("cdstatus=%02x\n", priv->cdstatus);

  return priv->cdstatus;
}

/****************************************************************************
 * Name: esp32p4_widebus
 *
 * Description:
 *   Called after change in Bus width has been selected (via ACMD6).  Most
 *   controllers will need to perform some special operations to work
 *   correctly in the new bus mode.
 *
 * Input Parameters:
 *   dev  - An instance of the SDIO device interface
 *   wide - true: wide bus (4-bit) bus mode enabled
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void esp32p4_widebus(struct sdio_dev_s *dev, bool wide)
{
  struct esp32p4_dev_s *priv = (struct esp32p4_dev_s *)dev;
  uint32_t regval;

#ifdef CONFIG_ESP32P4_SDMMC_SHARED_POLLED
  if (esp32p4_lock(dev, true) < 0) return;
#endif

  regval = esp32p4_getreg(ESP32P4_SDMMC_CTYPE);
  regval &= ~(SDMMC_CTYPE_WIDTH4_MASK(priv->slot));
  regval &= ~(SDMMC_CTYPE_WIDTH8_MASK(priv->slot));

#ifndef CONFIG_SDIO_WIDTH_D1_ONLY
  if (wide)
    {
      regval |= SDMMC_CTYPE_WIDTH4_MASK(priv->slot);

      if (priv->slot == 0)
        {
          esp_configgpio(40, INPUT | OUTPUT | PULLUP | DRIVE_3 | FUNCTION_1);
          esp_configgpio(41, INPUT | OUTPUT | PULLUP | DRIVE_3 | FUNCTION_1);
          esp_configgpio(42, INPUT | OUTPUT | PULLUP | DRIVE_3 | FUNCTION_1);
        }
      else
        {
          configure_pin(CONFIG_ESP32P4_SDMMC_D1, priv->sdio_pins->d1,
                        INPUT | OUTPUT | PULLUP);
          configure_pin(CONFIG_ESP32P4_SDMMC_D2, priv->sdio_pins->d2,
                        INPUT | OUTPUT | PULLUP);
          configure_pin(CONFIG_ESP32P4_SDMMC_D3, priv->sdio_pins->d3,
                        INPUT | OUTPUT | PULLUP);
        }
    }
#endif

  esp32p4_putreg(regval, ESP32P4_SDMMC_CTYPE);
#ifdef CONFIG_ESP32P4_SDMMC_SHARED_POLLED
  esp32p4_lock(dev, false);
#endif
}

/****************************************************************************
 * Name: sdmmc_host_clock_update_command
 *
 * Description:
 *   Issue the "update clock registers only" command to the CIU so that the
 *   new CLKDIV/CLKSRC/CLKENA values take effect.
 *
 ****************************************************************************/

static int sdmmc_host_clock_update_command(struct esp32p4_dev_s *priv)
{
  /* Clock update command; not a real command, just updates CIU registers */

  uint32_t cmd = SDMMC_CMD_UPDCLOCK | SDMMC_CMD_WAITPREV |
                 SDMMC_CMD_CARD_NUMBER(priv->slot);
  uint32_t regval;
  bool repeat = true;
  int timeout_ms = 100;
  int ret;

  while (repeat)
    {
      ret = esp32p4_ciu_sendcmd(cmd, 0);
      if (ret)
        {
          return ret;
        }

