uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_sdmmc.c
      while (timeout_ms)
        {
          regval = esp32p4_getreg(ESP32P4_SDMMC_RINTSTS);
          if (regval & SDMMC_INT_HLE)
            {
              esp32p4_putreg(SDMMC_INT_HLE, ESP32P4_SDMMC_RINTSTS);
              break;
            }

          if ((esp32p4_getreg(ESP32P4_SDMMC_CMD) & SDMMC_CMD_STARTCMD)
              == 0)
            {
              repeat = false;
              break;
            }

          timeout_ms--;
          up_mdelay(1);
        }
    }

  return timeout_ms > 0 ? OK : -ETIMEDOUT;
}

/****************************************************************************
 * Name: sdmmc_host_get_clk_dividers
 *
 * Description:
 *   Compute the host divider (feeding the LS clock in HP_SYS_CLKRST) and the
 *   card divider (SDMMC CLKDIV) for a requested card clock frequency.  The
 *   source clock is PLL160M as selected in the init function.
 *
 ****************************************************************************/

static void sdmmc_host_get_clk_dividers(uint32_t freq_khz, int *host_div,
                                        int *card_div)
{
#ifdef CONFIG_ESP32P4_SDMMC_SHARED_POLLED
  /* Keep the common source at 40MHz; only card-local dividers change. */

  *host_div = 4;
  *card_div = freq_khz >= 40000 ? 0 :
              (40000 + 2 * freq_khz - 1) / (2 * freq_khz);
#else
  uint32_t clk_src_freq_hz = ESP32P4_SDMMC_SRC_FREQ_HZ;

  /* Calculate new dividers */

  if (freq_khz >= 40 * 1000)
    {
      *host_div = 4;       /* 160 MHz / 4 = 40 MHz */
      *card_div = 0;
    }
  else if (freq_khz == 20 * 1000)
    {
      *host_div = 8;       /* 160 MHz / 8 = 20 MHz */
      *card_div = 0;
    }
  else if (freq_khz == 400)
    {
      *host_div = 10;      /* 160 MHz / 10 / (20 * 2) = 400 kHz */
      *card_div = 20;
    }
  else
    {
      /* For custom frequencies use maximum range of host divider (1-16),
       * find the closest <= div. combination.  If exceeded, combine with the
       * card divider to keep reasonable precision.
       */

      *host_div = (clk_src_freq_hz) / (freq_khz * 1000);
      if (*host_div > 15)
        {
          *host_div = 2;
          *card_div = (clk_src_freq_hz / 2) / (2 * freq_khz * 1000);
          if (((clk_src_freq_hz / 2) % (2 * freq_khz * 1000)) > 0)
            {
              (*card_div)++;
            }
        }
      else if ((clk_src_freq_hz % (freq_khz * 1000)) > 0)
        {
          (*host_div)++;
        }
    }
#endif
}

/****************************************************************************
 * Name: sdmmc_host_set_clk_div
 *
 * Description:
 *   Program the host divider and card divider.
 *
 *   KEY S3->P4 DIFFERENCE: on the S3 the host divider (h/l/n edge factors)
 *   was written to the SDMMC 0x800 CLOCK register.  On the P4 that divider
 *   moved into HP_SYS_CLKRST.PERI_CLK_CTRL02 (reg_sdio_ls_clk_edge_*), so we
 *   write it there and toggle the edge-config-update bit.  The card divider
 *   still lives in the SDMMC CLKDIV register as before.
 *
 ****************************************************************************/

static void sdmmc_host_set_clk_div(uint32_t slot, uint32_t host_div,
                                   uint32_t card_div)
{
  irqstate_t flags = enter_critical_section();

  /* Duty cycle 1/2: negedge at l, posedge at h, counter resets at n. */

  ASSERT(host_div > 1 && host_div <= 16);
  int l = host_div - 1;
  int h = host_div / 2 - 1;
  int n = host_div - 1;
  uint32_t regval;
  uint32_t divider;

  /* A divider of one selects the P4 SDIO high-speed bypass path.  All
   * frequencies handled here use the low-speed edge divider, so clear the
   * sticky HS-mode bit before programming those edges.  This mirrors
   * sdmmc_ll_set_clock_div(div > 1).
   */

  regval = esp32p4_getreg(ESP32P4_HP_SYS_CLKRST_PERI_CLK_CTRL01);
  regval &= ~HP_SYS_CLKRST_SDIO_HS_MODE;
  esp32p4_putreg(regval, ESP32P4_HP_SYS_CLKRST_PERI_CLK_CTRL01);

  /* Set card divider (SDMMC CLKDIV, indexed by the divider selected in
   * esp32p4_reset()).
   */

  regval = esp32p4_getreg(ESP32P4_SDMMC_CLKSRC);
  divider = (regval & SDMMC_CLKSRC_MASK(slot)) >> SDMMC_CLKSRC_SHIFT(slot);

  regval = esp32p4_getreg(ESP32P4_SDMMC_CLKDIV);
  regval &= ~SDMMC_CLKDIV_MASK(divider);
  regval |= SDMMC_CLKDIV(divider, card_div);
  esp32p4_putreg(regval, ESP32P4_SDMMC_CLKDIV);

#ifdef CONFIG_ESP32P4_SDMMC_SHARED_POLLED
  /* The common divider/phase was established before either card opened. */

  if (g_host_initialized)
    {
      leave_critical_section(flags);
      return;
    }
#endif

  /* Set the host divider and the drive/sample/self phase clocks in
   * HP_SYS_CLKRST.PERI_CLK_CTRL02.  ESP-IDF's sdmmc_ll_init_phase_delay()
   * does this on every clock change: drv/sam/slf clocks enabled, drive
   * edge = 1, sample/self edge = 0.  Leaving those clocks off lets CMD52
   * (CMD line) work while the DAT sampling path never starts, which is
   * exactly the CMD53 "R5 clean, FIFO empty, no DTO" failure.
   */

  regval = esp32p4_getreg(ESP32P4_HP_SYS_CLKRST_PERI_CLK_CTRL02);
  regval &= ~(HP_SYS_CLKRST_SDIO_LS_CLK_EDGE_L_M |
              HP_SYS_CLKRST_SDIO_LS_CLK_EDGE_H_M |
              HP_SYS_CLKRST_SDIO_LS_CLK_EDGE_N_M |
              HP_SYS_CLKRST_SDIO_LS_SLF_EDGE_SEL_M |
              HP_SYS_CLKRST_SDIO_LS_DRV_EDGE_SEL_M |
              HP_SYS_CLKRST_SDIO_LS_SAM_EDGE_SEL_M);
  regval |= (l << HP_SYS_CLKRST_SDIO_LS_CLK_EDGE_L_S) &
            HP_SYS_CLKRST_SDIO_LS_CLK_EDGE_L_M;
  regval |= (h << HP_SYS_CLKRST_SDIO_LS_CLK_EDGE_H_S) &
            HP_SYS_CLKRST_SDIO_LS_CLK_EDGE_H_M;
  regval |= (n << HP_SYS_CLKRST_SDIO_LS_CLK_EDGE_N_S) &
            HP_SYS_CLKRST_SDIO_LS_CLK_EDGE_N_M;
  /* drv=1, sam=0, slf=0 -- ESP-IDF sdmmc_ll_init_phase_delay() defaults.
   * The sample edge can be overridden later by
   * esp32p4_sdmmc_set_sample_phase().
   */

  regval |= (1u << HP_SYS_CLKRST_SDIO_LS_DRV_EDGE_SEL_S);
  regval |= HP_SYS_CLKRST_SDIO_LS_DRV_CLK_EN |
            HP_SYS_CLKRST_SDIO_LS_SAM_CLK_EN |
            HP_SYS_CLKRST_SDIO_LS_SLF_CLK_EN;
  esp32p4_putreg(regval, ESP32P4_HP_SYS_CLKRST_PERI_CLK_CTRL02);

  /* Latch the new edge configuration */

