uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_sdmmc.c
  regval |= HP_SYS_CLKRST_SDIO_LS_CLK_EDGE_UPD;
  esp32p4_putreg(regval, ESP32P4_HP_SYS_CLKRST_PERI_CLK_CTRL02);
  regval &= ~HP_SYS_CLKRST_SDIO_LS_CLK_EDGE_UPD;
  esp32p4_putreg(regval, ESP32P4_HP_SYS_CLKRST_PERI_CLK_CTRL02);

  leave_critical_section(flags);

  /* Wait for the clock to propagate */

  up_udelay(10);
}

/****************************************************************************
 * Name: esp32p4_clock
 *
 * Description:
 *   Enable/disable SDIO clocking
 *
 * Input Parameters:
 *   dev  - An instance of the SDIO device interface
 *   rate - Specifies the clocking to use (see enum sdio_clock_e)
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void esp32p4_clock(struct sdio_dev_s *dev, enum sdio_clock_e rate)
{
  uint32_t freq_khz;
  uint32_t regval;
  bool clk_en = true;
  int host_div = 0;   /* clock divider of the host (HP_SYS_CLKRST) */
  int card_div = 0;   /* 1/2 of card clock divider (SDMMC.clkdiv) */
  struct esp32p4_dev_s *priv = (struct esp32p4_dev_s *)dev;

#ifdef CONFIG_ESP32P4_SDMMC_SHARED_POLLED
  if (esp32p4_lock(dev, true) < 0) return;
#endif

  switch (rate)
    {
      /* Disable clocking (with default ID mode divisor) */

      default:
      case CLOCK_SDIO_DISABLED:
        freq_khz = 400;
        clk_en = false;
        break;

      /* Enable in initial ID mode clocking (<400KHz) */

      case CLOCK_IDMODE:
        freq_khz = 400;
        break;

      /* Enable in MMC normal operation clocking */

      case CLOCK_MMC_TRANSFER:
        if (esp32p4_capabilities(dev) & SDIO_CAPS_MMC_HS_MODE)
          {
            freq_khz = 40 * 1000;
          }
        else
          {
            freq_khz = 20 * 1000;
          }
        break;

      /* SD normal operation clocking (wide 4-bit mode) */

      case CLOCK_SD_TRANSFER_4BIT:
#ifndef CONFIG_SDIO_WIDTH_D1_ONLY
        freq_khz = 20 * 1000;
        esp32p4_widebus(dev, true);
        break;
#endif

      /* SD normal operation clocking (narrow 1-bit mode) */

      case CLOCK_SD_TRANSFER_1BIT:
        freq_khz = 20 * 1000;
        esp32p4_widebus(dev, false);
        break;
    }

  /* Disable clock first */

  regval = esp32p4_getreg(ESP32P4_SDMMC_CLKENA);
  regval &= ~(SDMMC_CLKENA_ENABLE(priv->slot)
              | SDMMC_CLKENA_LOWPOWER(priv->slot));
  esp32p4_putreg(regval, ESP32P4_SDMMC_CLKENA);
  if (sdmmc_host_clock_update_command(priv) != OK)
    {
      mcerr("disabling clk failed\n");
      goto done;
    }

  /* Program card clock settings, send them to the CIU */

  sdmmc_host_get_clk_dividers(freq_khz, &host_div, &card_div);
  sdmmc_host_set_clk_div(priv->slot, host_div, card_div);
  if (sdmmc_host_clock_update_command(priv) != OK)
    {
      mcerr("setting clk div failed\n");
      goto done;
    }

  /* Re-enable clocks */

  if (clk_en)
    {
      regval = esp32p4_getreg(ESP32P4_SDMMC_CLKENA);
      /* Match Espressif's SDMMC host sequence.  LOWPOWER stops CCLK while
       * the command/data path is idle; the ESP32-C6 SDIO slave uses that
       * idle boundary when applying CCCR state changes such as IOEN.
       */

      regval |= SDMMC_CLKENA_ENABLE(priv->slot) |
                SDMMC_CLKENA_LOWPOWER(priv->slot);
      esp32p4_putreg(regval, ESP32P4_SDMMC_CLKENA);
      if (sdmmc_host_clock_update_command(priv) != OK)
        {
          mcerr("re-enabling clk failed\n");
          goto done;
        }
    }

  /* Set data timeout to 100ms */

  if (freq_khz * 100 > (SDMMC_TMOUT_DATA_MASK >> SDMMC_TMOUT_DATA_SHIFT))
    {
      regval = SDMMC_TMOUT_DATA_MASK;
    }
  else
    {
      regval = freq_khz * 100 << SDMMC_TMOUT_DATA_SHIFT;
    }

  /* Always set response timeout to highest value; it's small enough */

  regval |= SDMMC_TMOUT_RESPONSE_MASK;
  esp32p4_putreg(regval, ESP32P4_SDMMC_TMOUT);
  priv->timeout_reg = regval;
done:
#ifdef CONFIG_ESP32P4_SDMMC_SHARED_POLLED
  esp32p4_lock(dev, false);
#endif
  return;
}

/****************************************************************************
 * Name: esp32p4_attach
 *
 * Description:
 *   Attach and prepare interrupts
 *
 * Input Parameters:
 *   dev - An instance of the SDIO device interface
 *
 * Returned Value:
 *   OK on success; A negated errno on failure.
 *
 ****************************************************************************/

static int esp32p4_attach(struct sdio_dev_s *dev)
{
#ifdef CONFIG_ESP32P4_SDMMC_SHARED_POLLED
  return -ENOTSUP;
#endif
  uint32_t regval;
  struct esp32p4_dev_s *priv = (struct esp32p4_dev_s *)dev;

  /* Stage-1 (SDIO link bring-up) is fully polled: esp32p4_waitresponse()
   * spins on RINTSTS.CMDDONE, so CMD5/CMD3/CMD7 enumeration and the CMD52
   * CCCR/CIS reads need no SDMMC interrupt at all.  Keep the controller
   * silent -- mask every source (main + IDMAC), drop the global interrupt
   * enable and clear all pending status -- and leave the CPU interrupt
   * un-attached.
   *
   * Wiring the SDMMC source through the ESP-IDF interrupt allocator
   * (esp_setup_irq -> esp_intr_alloc) currently hangs on the P4 the instant
   * the allocator's critical section is released (nuttx_exit_critical ->
   * up_irq_restore) as the SDMMC CPU interrupt is connected.  That only
   * gates the DMA data path (Stage 2+), so it must not block the link probe.
   */

  esp32p4_putreg(0, ESP32P4_SDMMC_INTMASK);
  esp32p4_putreg(0, ESP32P4_SDMMC_IDINTEN);
  regval  = esp32p4_getreg(ESP32P4_SDMMC_CTRL);
  regval &= ~(SDMMC_CTRL_INTENABLE | SDMMC_CTRL_INTDMA);
  esp32p4_putreg(regval, ESP32P4_SDMMC_CTRL);
  esp32p4_putreg(0xffffffff, ESP32P4_SDMMC_RINTSTS);
  esp32p4_putreg(0xffffffff, ESP32P4_SDMMC_IDSTS);

  /* Allocate the CPU interrupt for the SDIO host source and attach the
   * handler.  On the P4 esp_setup_irq() both allocates the CPU interrupt and
   * attaches the handler (see esp_i2c.c / esp_spi.c).
   */

  priv->cpuint = esp_setup_irq(ETS_SDIO_HOST_INTR_SOURCE,
                               ESP_IRQ_PRIORITY_DEFAULT,
                               ESP_IRQ_TRIGGER_LEVEL,
                               esp32p4_interrupt, priv);
  if (priv->cpuint < 0)
    {
      mcerr("ERROR: esp_setup_irq failed: %d\n", priv->cpuint);
      return priv->cpuint;
    }

  up_enable_irq(ESP_SOURCE2IRQ(ETS_SDIO_HOST_INTR_SOURCE));

