uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_sdmmc.c
  /* Re-enable the controller's global interrupt output.  It was cleared
   * above along with INTDMA so that a stale condition could not storm while
   * the handler was being registered, and nothing else in the driver ever
   * sets it again.  Without it the SDMMC never drives its interrupt line:
   * every data transfer ends in a wait timeout with MINTSTS non-zero and the
   * ISR entered zero times.
   */

  regval  = esp32p4_getreg(ESP32P4_SDMMC_CTRL);
  regval |= SDMMC_CTRL_INTENABLE;
  esp32p4_putreg(regval, ESP32P4_SDMMC_CTRL);

  return OK;
}

/****************************************************************************
 * Name: esp32p4_sendcmd
 *
 * Description:
 *   Send the SDIO command
 *
 * Input Parameters:
 *   dev - An instance of the SDIO device interface
 *   cmd - The command to send (32-bits, encoded)
 *   arg - 32-bit argument required with some commands
 *
 * Returned Value:
 *   OK
 *
 ****************************************************************************/

static int esp32p4_sendcmd(struct sdio_dev_s *dev, uint32_t cmd,
                           uint32_t arg)
{
  struct esp32p4_dev_s *priv = (struct esp32p4_dev_s *)dev;
  uint32_t regval = 0;

  mcinfo("cmd=%04" PRIx32 " arg=%04" PRIx32 "\n", cmd, arg);

  /* Clear any stale command-done / response-error status left over from the
   * previous command so esp32p4_waitresponse() polls only this command's
   * result.  This matters because R3/R4 responses carry no CRC or command
   * index and therefore always leave RE (and RCRC) asserted, which would
   * otherwise be mis-attributed to the next command.
   */

  esp32p4_putreg(SDCARD_RESPDONE_CLEAR, ESP32P4_SDMMC_RINTSTS);

  if (cmd == MMCSD_CMD12)
    {
      regval |= SDMMC_CMD_STOPABORT;
    }
  else if (cmd == MMCSD_CMD0)
    {
      /* The CMD0 needs the SENDINIT CMD */

      regval |= SDMMC_CMD_SENDINIT;
    }
  else
    {
      regval |= SDMMC_CMD_WAITPREV;
    }

  /* Is this a Read/Write Transfer Command ? */

  if ((cmd & MMCSD_WRDATAXFR) == MMCSD_WRDATAXFR)
    {
      regval |= SDMMC_CMD_DATAXFREXPTD | SDMMC_CMD_WRITE;
    }
  else if ((cmd & MMCSD_RDDATAXFR) == MMCSD_RDDATAXFR)
    {
      regval |= SDMMC_CMD_DATAXFREXPTD;
    }

  /* Set WAITRESP bits */

  switch (cmd & MMCSD_RESPONSE_MASK)
    {
    case MMCSD_NO_RESPONSE:
      regval |= SDMMC_CMD_NORESPONSE;
      break;

    case MMCSD_R1B_RESPONSE:
      regval |= SDMMC_CMD_RESPCRC;
      regval |= SDMMC_CMD_WAITPREV;
      regval |= SDMMC_CMD_SHORTRESPONSE;
      break;

    case MMCSD_R3_RESPONSE:
    case MMCSD_R4_RESPONSE:
      regval |= SDMMC_CMD_SHORTRESPONSE;
      break;

    case MMCSD_R1_RESPONSE:
    case MMCSD_R5_RESPONSE:
    case MMCSD_R6_RESPONSE:
    case MMCSD_R7_RESPONSE:
      regval |= SDMMC_CMD_RESPCRC;
      regval |= SDMMC_CMD_SHORTRESPONSE;
      break;

    case MMCSD_R2_RESPONSE:
      regval |= SDMMC_CMD_LONGRESPONSE;
      regval |= SDMMC_CMD_RESPCRC;
      break;
    }

  /* Set the command index */

  regval |= (cmd & MMCSD_CMDIDX_MASK) >> MMCSD_CMDIDX_SHIFT;
  regval |= SDMMC_CMD_CARD_NUMBER(priv->slot);

  /* Write the SD card CMD */

  return esp32p4_ciu_sendcmd(regval, arg) == 0 ? OK : -ETIMEDOUT;
}

/****************************************************************************
 * Name: esp32p4_blocksetup
 *
 * Description:
 *   Configure block size and the number of blocks for next transfer
 *
 * Input Parameters:
 *   dev      - An instance of the SDIO device interface
 *   blocklen - The selected block size.
 *   nblocks  - The number of blocks to transfer
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_SDIO_BLOCKSETUP
static void esp32p4_blocksetup(struct sdio_dev_s *dev, unsigned int blocklen,
                               unsigned int nblocks)
{
  /* Configure block size for next transfer */

  esp32p4_putreg(blocklen, ESP32P4_SDMMC_BLKSIZ);
  esp32p4_putreg(blocklen * nblocks, ESP32P4_SDMMC_BYTCNT);
}
#endif

/****************************************************************************
 * Name: esp32p4_recvsetup
 *
 * Description:
 *   Setup hardware in preparation for data transfer from the card in
 *   non-DMA (interrupt driven mode).  This method will do whatever
 *   controller setup is necessary.  This would be called for SD memory just
 *   BEFORE sending CMD13 (SEND_STATUS), CMD17 (READ_SINGLE_BLOCK), CMD18
 *   (READ_MULTIPLE_BLOCKS), ACMD51 (SEND_SCR), etc.  Normally,
 *   SDIO_WAITEVENT will be called to receive the transfer-complete
 *   indication.
 *
 * Input Parameters:
 *   dev    - An instance of the SDIO device interface
 *   buffer - Address of the buffer in which to receive the data
 *   nbytes - The number of bytes in the transfer
 *
 * Returned Value:
 *   Number of bytes sent on success; a negated errno on failure
 *
 ****************************************************************************/

static int esp32p4_recvsetup(struct sdio_dev_s *dev, uint8_t *buffer,
                             size_t nbytes)
{
  struct esp32p4_dev_s *priv = (struct esp32p4_dev_s *)dev;
#ifdef CONFIG_ESP32P4_SDMMC_DMA
  uint32_t regval;
#endif

  mcinfo("nbytes=%ld\n", (long)nbytes);

  DEBUGASSERT(priv != NULL && buffer != NULL && nbytes > 0);
  DEBUGASSERT(((uint32_t)(uintptr_t)buffer & 3) == 0);

  /* Save the destination buffer information for use by the interrupt
   * handler.
   */

  priv->buffer    = (uint32_t *)buffer;
  priv->remaining = nbytes;
  priv->wrdir     = false;

  /* Configure the FIFO so that we will receive the RXDR interrupt whenever
   * there are more than 1 words (at least 8 bytes) in the RX FIFO.
   */

  esp32p4_putreg(SDMMC_FIFOTH_RXWMARK(1), ESP32P4_SDMMC_FIFOTH);

#ifdef CONFIG_ESP32P4_SDMMC_DMA
  /* Make sure that internal DMA is disabled */

  esp32p4_putreg(0, ESP32P4_SDMMC_BMOD);

  regval  = esp32p4_getreg(ESP32P4_SDMMC_CTRL);
  regval &= ~(SDMMC_CTRL_INTDMA | SDMMC_CTRL_DMAENABLE);
  esp32p4_putreg(regval, ESP32P4_SDMMC_CTRL);
#endif

  /* Flush ints before we start */

