uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_sdmmc.c
  esp32p4_putreg(SDCARD_TRANSFER_ALL, ESP32P4_SDMMC_RINTSTS);

  /* Configure the transfer interrupts */

  esp32p4_config_xfrints(priv, SDCARD_RECV_MASK);
  return OK;
}

/****************************************************************************
 * Name: esp32p4_sendsetup
 *
 * Description:
 *   Setup hardware in preparation for data transfer from the card.  This
 *   method will do whatever controller setup is necessary.  This would be
 *   called for SD memory just AFTER sending CMD24 (WRITE_BLOCK), CMD25
 *   (WRITE_MULTIPLE_BLOCK), ... and before SDIO_SENDDATA is called.
 *
 * Input Parameters:
 *   dev    - An instance of the SDIO device interface
 *   buffer - Address of the buffer containing the data to send
 *   nbytes - The number of bytes in the transfer
 *
 * Returned Value:
 *   Number of bytes sent on success; a negated errno on failure
 *
 ****************************************************************************/

static int esp32p4_sendsetup(struct sdio_dev_s *dev, const uint8_t *buffer,
                             size_t nbytes)
{
  struct esp32p4_dev_s *priv = (struct esp32p4_dev_s *)dev;
#ifdef CONFIG_ESP32P4_SDMMC_DMA
  uint32_t regval;
#endif

  mcinfo("nbytes=%ld\n", (long)nbytes);

  DEBUGASSERT(priv != NULL && buffer != NULL && nbytes > 0);
  DEBUGASSERT(((uint32_t)(uintptr_t)buffer & 3) == 0);

  /* Save the source buffer information for use by the interrupt handler */

  priv->buffer    = (uint32_t *)buffer;
  priv->remaining = nbytes;
  priv->wrdir     = true;

  /* Configure the FIFO so that we will receive the TXDR interrupt whenever
   * the TX FIFO is at least half empty.
   */

  esp32p4_putreg(SDMMC_FIFOTH_TXWMARK(ESP32P4_TXFIFO_DEPTH / 2),
                 ESP32P4_SDMMC_FIFOTH);

#ifdef CONFIG_ESP32P4_SDMMC_DMA
  /* Make sure that internal DMA is disabled */

  esp32p4_putreg(0, ESP32P4_SDMMC_BMOD);

  regval  = esp32p4_getreg(ESP32P4_SDMMC_CTRL);
  regval &= ~(SDMMC_CTRL_INTDMA | SDMMC_CTRL_DMAENABLE);
  esp32p4_putreg(regval, ESP32P4_SDMMC_CTRL);
#endif

  /* Flush ints before we start */

  esp32p4_putreg(SDCARD_TRANSFER_ALL, ESP32P4_SDMMC_RINTSTS);

  /* Configure the transfer interrupts */

  esp32p4_config_xfrints(priv, SDCARD_SEND_MASK);
  return OK;
}

/****************************************************************************
 * Name: esp32p4_cancel
 *
 * Description:
 *   Cancel the data transfer setup of SDIO_RECVSETUP, SDIO_SENDSETUP,
 *   SDIO_DMARECVSETUP or SDIO_DMASENDSETUP.  This must be called to cancel
 *   the data transfer setup if, for some reason, you cannot perform the
 *   transfer.
 *
 * Input Parameters:
 *   dev - An instance of the SDIO device interface
 *
 * Returned Value:
 *   OK is success; a negated errno on failure
 *
 ****************************************************************************/

static int esp32p4_cancel(struct sdio_dev_s *dev)
{
  struct esp32p4_dev_s *priv = (struct esp32p4_dev_s *)dev;

#ifdef CONFIG_ESP32P4_SDMMC_SHARED_POLLED
  /* CANCEL is not proof that DMA stopped.  Exclude every subsequent
   * transaction until reboot, even if the command/data busy bits clear.
   */

  if (priv->remaining) g_host_fault = true;
#endif

  mcinfo("Cancelling..\n");

  /* Disable all transfer- and event- related interrupts */

  esp32p4_disable_allints(priv);

  /* Clearing pending interrupt status on all transfer- and event- related
   * interrupts
   */

  esp32p4_putreg(SDCARD_WAITALL_CLEAR, ESP32P4_SDMMC_RINTSTS);

  /* Cancel any watchdog timeout */

  wd_cancel(&priv->waitwdog);

  /* Mark no transfer in progress */

  priv->remaining = 0;
  return OK;
}

/****************************************************************************
 * Name: esp32p4_waitresponse
 *
 * Description:
 *   Poll-wait for the response to the last command to be ready.
 *
 * Input Parameters:
 *   dev - An instance of the SDIO device interface
 *   cmd - The command that was sent.  See 32-bit command definitions above.
 *
 * Returned Value:
 *   OK is success; a negated errno on failure
 *
 ****************************************************************************/

static int esp32p4_waitresponse(struct sdio_dev_s *dev, uint32_t cmd)
{
  int ret = OK;
  volatile int32_t timeout;
  clock_t watchtime;
  uint32_t respmask;

  mcinfo("cmd=%04" PRIx32 "\n", cmd);

  switch (cmd & MMCSD_RESPONSE_MASK)
    {
    case MMCSD_NO_RESPONSE:
    case MMCSD_R3_RESPONSE:
    case MMCSD_R7_RESPONSE:
      timeout = SDCARD_CMDTIMEOUT;
      break;

    case MMCSD_R1_RESPONSE:
    case MMCSD_R1B_RESPONSE:
    case MMCSD_R2_RESPONSE:
    case MMCSD_R4_RESPONSE:
    case MMCSD_R5_RESPONSE:
    case MMCSD_R6_RESPONSE:
      timeout = SDCARD_LONGTIMEOUT;
      break;

    default:
      return -EINVAL;
    }

  watchtime = clock_systime_ticks();

  /* We should wait for CMDDONE, even if there is a response error. */

  while ((esp32p4_getreg(ESP32P4_SDMMC_RINTSTS) & SDMMC_INT_CDONE) == 0)
    {
      if (clock_systime_ticks() - watchtime > timeout)
        {
          mcerr("ERROR: Timeout cmd: %04" PRIx32 " STA: %08" PRIx32
                " RINTSTS: %08" PRIx32 "\n",
                cmd, esp32p4_getreg(ESP32P4_SDMMC_STATUS),
                esp32p4_getreg(ESP32P4_SDMMC_RINTSTS));

          ret = -ETIMEDOUT;
          break;
        }
    }

  /* Check if there is a response error.  R3 and R4 responses carry neither
   * a CRC (the CRC field is all ones) nor the command index (it is reserved
   * and transmitted as all ones), so the DesignWare controller always
   * raises RE/RCRC for them -- only a response timeout (RTO) is a genuine
   * error in that case.  For every other response type keep the full check.
   */

  respmask = SDCARD_INT_RESPERR;
  if ((cmd & MMCSD_RESPONSE_MASK) == MMCSD_R3_RESPONSE ||
      (cmd & MMCSD_RESPONSE_MASK) == MMCSD_R4_RESPONSE)
    {
      respmask = SDMMC_INT_RTO;
    }
  else if ((cmd & MMCSD_RESPONSE_MASK) == MMCSD_R5_RESPONSE)
    {
      /* The P4 DesignWare host asserts RE on valid SDIO R5 responses.
       * RESP0, response CRC and command-done remain valid, so reject only
       * transport failures here.  sdio_io_rw_direct/extended still parse
       * the error flags carried by R5 itself.
       */

      respmask = SDMMC_INT_RCRC | SDMMC_INT_RTO;
    }

  if (esp32p4_getreg(ESP32P4_SDMMC_RINTSTS) & respmask)
    {
      mcerr("ERROR: SDMMC failure cmd: %04" PRIx32 " STA: %08" PRIx32
            " RINTSTS: %08" PRIx32 "\n",
            cmd, esp32p4_getreg(ESP32P4_SDMMC_STATUS),
            esp32p4_getreg(ESP32P4_SDMMC_RINTSTS));
      ret = -EIO;
    }

  /* Response errors are write-one-to-clear and remain sticky across
   * commands.  Clear them together with command-done so a transient timeout
   * cannot poison every command that follows.
   */

  esp32p4_putreg(SDCARD_RESPDONE_CLEAR, ESP32P4_SDMMC_RINTSTS);
  return ret;
}

/****************************************************************************
 * Name: esp32p4_recvshortcrc
 *
 * Description:
 *   Receive response to SDIO command.  Only the critical payload is
 *   returned -- 32 bits for 48 bit status.  The driver implementation
 *   verifies the correctness of the remaining, non-returned bits (CRCs, CMD
 *   index, etc.).
 *
 * Input Parameters:
 *   dev    - An instance of the SDIO device interface
 *   cmd    - The command that was sent
 *   rshort - Buffer in which to receive the response
 *
 * Returned Value:
 *   OK on success; a negated errno on failure.
 *
 ****************************************************************************/

static int esp32p4_recvshortcrc(struct sdio_dev_s *dev, uint32_t cmd,
                                uint32_t *rshort)
{
  uint32_t regval;
  int ret = OK;

  mcinfo("cmd=%04" PRIx32 "\n", cmd);

#ifdef CONFIG_DEBUG_FEATURES
  if (!rshort)
    {
      mcerr("ERROR: rshort=NULL\n");
      ret = -EINVAL;
    }

  /* Check that this is the correct response to this command */

  else if ((cmd & MMCSD_RESPONSE_MASK) != MMCSD_R1_RESPONSE &&
           (cmd & MMCSD_RESPONSE_MASK) != MMCSD_R1B_RESPONSE &&
           (cmd & MMCSD_RESPONSE_MASK) != MMCSD_R5_RESPONSE &&
           (cmd & MMCSD_RESPONSE_MASK) != MMCSD_R6_RESPONSE)
    {
      mcerr("ERROR: Wrong response CMD=%04x\n", cmd);
      ret = -EINVAL;
    }
  else
#endif
    {
      /* Check if a timeout or CRC error occurred */

