uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_sdmmc.c
      /* Handle a cornercase: The user requested a timeout event but with
       * timeout == 0?
       */

      if (!timeout)
        {
          priv->wkupevent = SDIOWAIT_TIMEOUT;
          return;
        }

      /* Start the watchdog timer */

      delay = MSEC2TICK(timeout);
      ret   = wd_start(&priv->waitwdog, delay,
                       esp32p4_eventtimeout, (wdparm_t)priv);
      if (ret < 0)
        {
          mcerr("ERROR: wd_start failed: %d\n", ret);
        }
    }
}

/****************************************************************************
 * Name: esp32p4_eventwait
 *
 * Description:
 *   Wait for one of the enabled events to occur (or a timeout).  Note that
 *   all events enabled by SDIO_WAITEVENTS are disabled when
 *   esp32p4_eventwait returns.  SDIO_WAITEVENTS must be called again before
 *   esp32p4_eventwait can be used again.
 *
 * Input Parameters:
 *   dev - An instance of the SDIO device interface
 *
 * Returned Value:
 *   Event set containing the event(s) that ended the wait.  Should always
 *   be non-zero.  All events are disabled after the wait concludes.
 *
 ****************************************************************************/

static sdio_eventset_t esp32p4_eventwait(struct sdio_dev_s *dev)
{
  struct esp32p4_dev_s *priv = (struct esp32p4_dev_s *)dev;
  sdio_eventset_t wkupevent = 0;
  irqstate_t flags;
  clock_t start;
  int ret;

  /* There is a race condition here... the event may have completed before
   * we get here.  In this case waitevents will be zero, but wkupevents will
   * be non-zero (and, hopefully, the semaphore count will also be non-zero).
   */

  flags = enter_critical_section();
  DEBUGASSERT(priv->waitevents != 0 || priv->wkupevent != 0);

  /* Polled completion.
   *
   * The SDMMC CPU interrupt cannot be relied on here.  esp_setup_irq() ->
   * esp_intr_alloc() may share one CPU interrupt line between several
   * peripheral sources, while riscv_dispatch_irq() resolves a cpuint to a
   * single irq by scanning the handle map and taking the first match -- so a
   * shared line delivers only one source's handler, the other source's
   * condition is never cleared, and the line storms.  The defence added in
   * riscv_dispatch_irq() (masking a handler-less cpuint) stops the storm but
   * leaves the SDMMC line masked for good: observed as MINTSTS non-zero with
   * zero ISR entries and every data transfer ending in a wait timeout.
   *
   * Stage-1 already runs the whole command path polled, so do the same for
   * the data path: drive the exact same handler from this context until it
   * posts a wake-up event.  The critical section is dropped around each pass
   * so the timeout watchdog can still run.  A tick deadline is the backstop
   * if the watchdog never fires from this context.
   */

  start = clock_systime_ticks();

  for (; ; )
    {
      /* Prefer real hardware state over an expired polling deadline. */

      leave_critical_section(flags);
      esp32p4_interrupt(0, NULL, priv);
      flags = enter_critical_section();
      wkupevent = priv->wkupevent;
      if (wkupevent != 0)
        {
          break;
        }

      if ((clock_systime_ticks() - start) > MSEC2TICK(1500))
        {
#ifdef CONFIG_ESP32P4_SDMMC_SHARED_POLLED
          g_host_fault = true;
#endif
          wkupevent = SDIOWAIT_TIMEOUT;
          priv->wkupevent = wkupevent;
          wd_cancel(&priv->waitwdog);
          break;
        }
    }

  UNUSED(ret);

  /* The IDMAC wrote straight into memory, so drop any cache lines the CPU
   * may still hold for that buffer.  The invalidate done in
   * esp32p4_dmarecvsetup() only covers the pre-transfer state; without this
   * second one the caller reads the stale (all-zero) contents even though
   * the descriptor consumed every byte.
   */

  if (priv->dmarxbuf != NULL)
    {
      size_t sync = (priv->dmarxlen + 63u) & ~63u;
      int mret;

      /* M2C + UNALIGNED is rejected by esp_cache_msync (no-op).  The RX
       * buffer is 64-byte aligned; round the length up to a cache line
       * so the invalidate actually runs.
       */

      mret = esp_cache_msync(priv->dmarxbuf, sync,
                             ESP_CACHE_MSYNC_FLAG_DIR_M2C);
      UNUSED(mret);
      priv->dmarxbuf = NULL;
    }

  if ((wkupevent & (SDIOWAIT_ERROR | SDIOWAIT_TIMEOUT)) != 0)
    {
#ifdef CONFIG_ESP32P4_SDMMC_DMA
      esp_cache_msync((void *)(uintptr_t)priv->dma_desc,
                      sizeof(struct sdmmc_dma_s),
                      ESP_CACHE_MSYNC_FLAG_DIR_M2C);
#endif
      syslog(LOG_ERR,
             "SDMMCPROBE: wait error evt=0x%02x remaining=%d "
             "RINTSTS=0x%08lx STATUS=0x%08lx IDSTS=0x%08lx CTYPE=0x%08lx\n",
             wkupevent, priv->remaining,
             (unsigned long)esp32p4_getreg(ESP32P4_SDMMC_RINTSTS),
             (unsigned long)esp32p4_getreg(ESP32P4_SDMMC_STATUS),
             (unsigned long)esp32p4_getreg(ESP32P4_SDMMC_IDSTS),
             (unsigned long)esp32p4_getreg(ESP32P4_SDMMC_CTYPE));

#ifdef CONFIG_ESP32P4_SDMMC_DMA
      syslog(LOG_ERR,
             "SDMMCPROBE: DBADDR=0x%08lx desc@%p des0=0x%08lx des1=0x%08lx "
             "des2=0x%08lx des3=0x%08lx OWN=%d\n",
             (unsigned long)esp32p4_getreg(ESP32P4_SDMMC_DBADDR),
             (void *)priv->dma_desc,
             (unsigned long)priv->dma_desc[0].des0,
             (unsigned long)priv->dma_desc[0].des1,
             (unsigned long)priv->dma_desc[0].des2,
             (unsigned long)priv->dma_desc[0].des3,
             (priv->dma_desc[0].des0 & MCI_DMADES0_OWN) ? 1 : 0);
#endif
    }

  /* Disable all transfer- and event- related interrupts */

  esp32p4_disable_allints(priv);

  leave_critical_section(flags);

  mcinfo("wkupevent=%04x\n", wkupevent);
  return wkupevent;
}

/****************************************************************************
 * Name: esp32p4_callbackenable
 *
 * Description:
 *   Enable/disable of a set of SDIO callback events.  This is part of the
 *   SDIO callback sequence.  The set of events is configured to enable
 *   callbacks to the function provided in esp32p4_registercallback.
 *
 *   Events are automatically disabled once the callback is performed and no
 *   further callback events will occur until they are again enabled by
 *   calling this method.
 *
 * Input Parameters:
 *   dev      - An instance of the SDIO device interface
 *   eventset - A bitset of events to enable or disable (see SDIOMEDIA_*
 *              definitions). 0=disable; 1=enable.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void esp32p4_callbackenable(struct sdio_dev_s *dev,
                                   sdio_eventset_t eventset)
{
  struct esp32p4_dev_s *priv = (struct esp32p4_dev_s *)dev;

