uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_sdmmc.c
  mcinfo("eventset: %02x\n", eventset);
  DEBUGASSERT(priv != NULL);

  priv->cbevents = eventset;
  esp32p4_callback(priv);
}

/****************************************************************************
 * Name: esp32p4_registercallback
 *
 * Description:
 *   Register a callback that that will be invoked on any media status
 *   change.  Callbacks should not be made from interrupt handlers, rather
 *   interrupt level events should be handled by calling back on the work
 *   thread.
 *
 *   When this method is called, all callbacks should be disabled until they
 *   are enabled via a call to SDIO_CALLBACKENABLE
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   callback - The function to call on the media change
 *   arg      - A caller provided value to return with the callback
 *
 * Returned Value:
 *   0 on success; negated errno on failure.
 *
 ****************************************************************************/

static int esp32p4_registercallback(struct sdio_dev_s *dev,
                                    worker_t callback, void *arg)
{
  struct esp32p4_dev_s *priv = (struct esp32p4_dev_s *)dev;

  /* Disable callbacks and register this callback and is argument */

  mcinfo("Register %p(%p)\n", callback, arg);
  DEBUGASSERT(priv != NULL);

  priv->cbevents = 0;
  priv->cbarg    = arg;
  priv->callback = callback;
  return OK;
}

/****************************************************************************
 * Name: esp32p4_fill_dma_desc
 *
 * Description:
 *   Build the IDMAC descriptor chain for the current transfer and write the
 *   descriptor memory back from cache so the IDMAC observes it.
 *
 ****************************************************************************/

#ifdef CONFIG_ESP32P4_SDMMC_DMA
static int esp32p4_fill_dma_desc(struct esp32p4_dev_s *priv)
{
  uint32_t ctrl;
  uint32_t maxs;
  int i = 0;
  size_t buflen = priv->remaining;
  uint32_t buffer = (uint32_t)(uintptr_t)priv->buffer;

  /* Setup DMA list */

  while (buflen > 0)
    {
      /* Limit size of the transfer to maximum buffer size */

      maxs = buflen;

      if (maxs > MCI_DMADES1_MAXTR)
        {
          maxs = MCI_DMADES1_MAXTR;
        }

      buflen -= maxs;

      /* Set buffer size */

      priv->dma_desc[i].des1 = MCI_DMADES1_BS1(maxs);

      /* IDMAC sees the CPU SRAM address.  The caller reads the payload
       * back through the 0x8FFxxxxx non-cacheable alias.
       */

      priv->dma_desc[i].des2 = buffer + (i * MCI_DMADES1_MAXTR);

      /* Setup basic control */

      ctrl = MCI_DMADES0_OWN | MCI_DMADES0_CH;

      if (i == 0)
        {
          ctrl |= MCI_DMADES0_FS; /* First DMA buffer */
        }

      /* No more data?  Then this is the last descriptor */

      if (buflen == 0)
        {
          ctrl |= MCI_DMADES0_LD;
          priv->dma_desc[i].des3 = 0;
        }
      else
        {
          ctrl |= MCI_DMADES0_DIC;
          priv->dma_desc[i].des3 =
            (uint32_t)(uintptr_t)&priv->dma_desc[i + 1];
        }

      priv->dma_desc[i].des0 = ctrl;
      memset((void *)priv->dma_desc[i].reserved, 0,
             sizeof(priv->dma_desc[i].reserved));
      i++;
    }

  DEBUGASSERT(i < NUM_DMA_DESCRIPTORS);

  /* Write the descriptor list back from cache so the IDMAC sees it.  P4 has
   * a data cache; the descriptors live in cached internal SRAM.
   */

  esp_cache_msync((void *)(uintptr_t)priv->dma_desc,
                  sizeof(struct sdmmc_dma_s) * (size_t)i,
                  ESP_CACHE_MSYNC_FLAG_DIR_C2M);

  return 0;
}
#endif

/****************************************************************************
 * Name: esp32p4_dmarecvsetup
 *
 * Description:
 *   Setup to perform a read DMA.  If the processor supports a data cache,
 *   then this method will also make sure that the contents of the DMA memory
 *   and the data cache are coherent.  For read transfers this may mean
 *   invalidating the data cache.
 *
 * Input Parameters:
 *   dev    - An instance of the SDIO device interface
 *   buffer - The memory to DMA from
 *   buflen - The size of the DMA transfer in bytes
 *
 * Returned Value:
 *   OK on success; a negated errno on failure
 *
 ****************************************************************************/

#ifdef CONFIG_ESP32P4_SDMMC_DMA
static void esp32p4_idmac_arm(struct esp32p4_dev_s *priv, bool rx)
{
  sdmmc_dev_t *hw = SDMMC_LL_GET_HW(0);
  uint32_t bmod;
  int wait;

  /* IDMAC burst of 8 x 32-bit words.  RX watermark 0 so a 44-byte hosted
   * frame still generates a DMA request.  Do not enable CARDTHR: a 512-byte
   * threshold never trips on a short SDIO frame.
   */

  if (rx)
    {
      /* Burst=1: an 8-beat burst reread the first FIFO word (observed
       * 0x00200005 three times) before the pointer advanced.
       */

      esp32p4_putreg(SDMMC_FIFOTH_RXWMARK(0) | SDMMC_FIFOTH_DMABURST_1XFR,
                     ESP32P4_SDMMC_FIFOTH);
      esp32p4_putreg(0, ESP32P4_SDMMC_CARDTHR);
    }
  else
    {
      esp32p4_putreg(SDMMC_FIFOTH_TXWMARK(ESP32P4_TXFIFO_DEPTH / 2) |
                     SDMMC_FIFOTH_DMABURST_1XFR,
                     ESP32P4_SDMMC_FIFOTH);
      esp32p4_putreg(0, ESP32P4_SDMMC_CARDTHR);
    }

  /* ESP-IDF calls init_dma() once at host init (already done in
   * esp32p4_sdmmc_sdio_initialize).  Re-running BMOD.SWR here left IDMAC
   * in reset across the CMD53 data phase (OWN stuck, buffer zero).
   */

  bmod = esp32p4_getreg(ESP32P4_SDMMC_BMOD);
  if ((bmod & SDMMC_BMOD_SWR) != 0)
    {
      for (wait = 0; wait < 1000; wait++)
        {
          if ((esp32p4_getreg(ESP32P4_SDMMC_BMOD) & SDMMC_BMOD_SWR) == 0)
            {
              break;
            }
        }
    }

  sdmmc_ll_set_desc_addr(hw, (uint32_t)(uintptr_t)&priv->dma_desc[0]);
  sdmmc_ll_enable_dma(hw, true);

  /* enable_dma() leaves BMOD.PBL at the reset default (8).  Force single
   * beat so it matches FIFOTH and the SDIO slave FIFO pop behaviour.
   */

  esp32p4_putreg(SDMMC_BMOD_DE | SDMMC_BMOD_FB, ESP32P4_SDMMC_BMOD);
  sdmmc_ll_poll_demand(hw);
}

static int esp32p4_dmarecvsetup(struct sdio_dev_s *dev, uint8_t *buffer,
                                size_t buflen)
{
  struct esp32p4_dev_s *priv = (struct esp32p4_dev_s *)dev;

  DEBUGASSERT(priv != NULL);
  DEBUGASSERT(buffer != NULL && buflen > 0 &&
              ((uint32_t)(uintptr_t)buffer & 3) == 0);

  /* Save the destination buffer information for use by the interrupt
   * handler.
   */

  priv->buffer    = (uint32_t *)buffer;
  priv->remaining = buflen;
  priv->wrdir     = false;
  priv->dmarxbuf  = buffer;
  priv->dmarxlen  = buflen;

  /* Setup DMA list */

  if (esp32p4_fill_dma_desc(priv))
    {
      return -ENOMEM;
    }

  /* Flush any CPU paint/zeroing into SRAM so a failed DMA is visible as
   * the pre-fill pattern.  After the transfer, eventwait invalidates so
   * the CPU sees IDMAC writes.
   */

