uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_sdmmc.c
  esp_cache_msync(buffer, buflen,
                  ESP_CACHE_MSYNC_FLAG_DIR_C2M |
                  ESP_CACHE_MSYNC_FLAG_UNALIGNED);

  /* Flush ints before we start */

  esp32p4_putreg(SDCARD_TRANSFER_ALL, ESP32P4_SDMMC_RINTSTS);
  esp32p4_putreg(0xffffffff, ESP32P4_SDMMC_IDSTS);

  esp32p4_idmac_arm(priv, true);

  /* Setup DMA error interrupts */

  esp32p4_config_dmaints(priv, SDCARD_DMARECV_MASK, SDCARD_DMAERROR_MASK);
  return OK;
}
#endif

/****************************************************************************
 * Name: esp32p4_dmasendsetup
 *
 * Description:
 *   Setup to perform a write DMA.  If the processor supports a data cache,
 *   then this method will also make sure that the contents of the DMA memory
 *   and the data cache are coherent.  For write transfers, this may mean
 *   flushing the data cache.
 *
 * Input Parameters:
 *   dev    - An instance of the SDIO device interface
 *   buffer - The memory to DMA into
 *   buflen - The size of the DMA transfer in bytes
 *
 * Returned Value:
 *   OK on success; a negated errno on failure
 *
 ****************************************************************************/

#ifdef CONFIG_ESP32P4_SDMMC_DMA
static int esp32p4_dmasendsetup(struct sdio_dev_s *dev,
                                const uint8_t *buffer, size_t buflen)
{
  struct esp32p4_dev_s *priv = (struct esp32p4_dev_s *)dev;

  DEBUGASSERT(priv != NULL);

  mcinfo("buflen=%lu\n", (unsigned long)buflen);
  DEBUGASSERT(buffer != NULL && buflen > 0 &&
              ((uint32_t)(uintptr_t)buffer & 3) == 0);

  /* Save the source buffer information for use by the interrupt handler. */

  priv->buffer    = (uint32_t *)buffer;
  priv->remaining = buflen;
  priv->wrdir     = true;
  priv->dmarxbuf  = NULL;
  priv->dmarxlen  = 0;

  /* Setup DMA descriptor list */

  if (esp32p4_fill_dma_desc(priv))
    {
      return -ENOMEM;
    }

  /* Write the source buffer back from cache so the IDMAC reads valid data */

  esp_cache_msync((void *)buffer, buflen,
                  ESP_CACHE_MSYNC_FLAG_DIR_C2M |
                  ESP_CACHE_MSYNC_FLAG_UNALIGNED);

  /* Flush ints before we start */

  esp32p4_putreg(SDCARD_TRANSFER_ALL, ESP32P4_SDMMC_RINTSTS);
  esp32p4_putreg(0xffffffff, ESP32P4_SDMMC_IDSTS);

  esp32p4_idmac_arm(priv, false);

  /* Setup DMA error interrupts */

  esp32p4_config_dmaints(priv, SDCARD_DMASEND_MASK, SDCARD_DMAERROR_MASK);
  return OK;
}
#endif

/****************************************************************************
 * Name: esp32p4_callback
 *
 * Description:
 *   Perform callback.
 *
 * Assumptions:
 *   This function does not execute in the context of an interrupt handler.
 *   It may be invoked on any user thread or scheduled on the work thread
 *   from an interrupt handler.
 *
 ****************************************************************************/

static void esp32p4_callback(void *arg)
{
  struct esp32p4_dev_s *priv = (struct esp32p4_dev_s *)arg;

  /* Is a callback registered? */

  DEBUGASSERT(priv != NULL);
  mcinfo("Callback %p(%p) cbevents: %02x cdstatus: %02x\n",
         priv->callback, priv->cbarg, priv->cbevents, priv->cdstatus);

  if (priv->callback)
    {
      /* Yes.. Check for enabled callback events */

      if ((priv->cdstatus & SDIO_STATUS_PRESENT) != 0)
        {
          /* Media is present.  Is the media inserted event enabled? */

          if ((priv->cbevents & SDIOMEDIA_INSERTED) == 0)
            {
              /* No... return without performing the callback */

              return;
            }
        }
      else
        {
          /* Media is not present.  Is the media eject event enabled? */

          if ((priv->cbevents & SDIOMEDIA_EJECTED) == 0)
            {
              /* No... return without performing the callback */

              return;
            }
        }

      /* Perform the callback, disabling further callbacks.  Of course, the
       * callback can (and probably should) re-enable callbacks.
       */

      priv->cbevents = 0;

      /* Callbacks cannot be performed in the context of an interrupt
       * handler.  If we are in an interrupt handler, then queue the
       * callback to be performed later on the work thread.
       */

      if (up_interrupt_context())
        {
          /* Yes.. queue it */

          mcinfo("Queuing callback to %p(%p)\n",
                 priv->callback, priv->cbarg);
          work_queue(HPWORK, &priv->cbwork, priv->callback,
                     priv->cbarg, 0);
        }
      else
        {
          /* No.. then just call the callback here */

          mcinfo("Callback to %p(%p)\n", priv->callback, priv->cbarg);
          priv->callback(priv->cbarg);
        }
    }
}

/****************************************************************************
 * Name: esp32p4_sdmmc_enable_clock_reset
 *
 * Description:
 *   Enable the SDMMC bus clock, pulse the module reset, select the LS clock
 *   source (PLL160M) and initialise the clock phase.  These use the P4
 *   HP_SYS_CLKRST / LP_CLKRST blocks -- the S3 did the equivalent in the
 *   SYSTEM_PERIP_CLK_EN1 / SYSTEM_PERIP_RST_EN1 registers and in the SDMMC
 *   0x800 CLOCK register.  This is the KEY clock adaptation to verify on
 *   hardware.
 *
 ****************************************************************************/

static void esp32p4_sdmmc_enable_clock_reset(void)
{
  sdmmc_dev_t *hw = SDMMC_LL_GET_HW(0);

  /* PERIPH_RCC_ATOMIC() provides the __DECLARE_RCC_ATOMIC_ENV that the HAL
   * clock helpers require and the surrounding critical section.
   */

  PERIPH_RCC_ATOMIC()
    {
      /* Enable the AHB bus clock and pulse the module reset */

      sdmmc_ll_enable_bus_clock(0, true);
      sdmmc_ll_reset_register(0);

      /* Power up the SDIO PLL (PMU) -- without this the selected clock
       * source produces no clock and the controller reset never completes.
       */

      sdmmc_ll_enable_sdio_pll(hw, true);

      /* Select PLL160M as the LS clock source and set the host divider */

