uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_sdmmc.c
      sdmmc_ll_select_clk_source(hw, SDMMC_CLK_SRC_PLL160M);
      sdmmc_ll_set_clock_div(hw, 2);
      sdmmc_ll_init_phase_delay(hw);
    }
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32p4_sdmmc_sdio_initialize
 *
 * Description:
 *   Initialize the SDMMC host for SDIO operation.
 *
 * Input Parameters:
 *   slotno - The SDMMC slot (0 or 1).  The on-board C6 is on slot 1.
 *
 * Returned Value:
 *   A reference to an SDIO interface structure.  NULL is returned on
 *   failures.
 *
 ****************************************************************************/

struct sdio_dev_s *esp32p4_sdmmc_sdio_initialize(int slotno)
{
#ifndef CONFIG_ESP32P4_SDMMC_SHARED_POLLED
  static int owner = -1;
  struct esp32p4_dev_s *priv = &g_sdiodev;
#else
  struct esp32p4_dev_s *priv;
#endif
  uint32_t regval;
#ifndef CONFIG_ESP32P4_SDMMC_SHARED_POLLED
  irqstate_t flags;
#endif

  if (slotno != 0 && slotno != 1)
    {
      return NULL;
    }

  /* One controller and one software instance: do not reset an active
   * other slot.  Switching between isolated diagnostics requires reboot.
   */

#ifdef CONFIG_ESP32P4_SDMMC_SHARED_POLLED
  if (nxrmutex_lock(&g_host_lock) < 0) return NULL;
  priv = &g_slots[slotno];
  if (g_slot_initialized[slotno] || g_host_fault)
    {
      nxrmutex_unlock(&g_host_lock);
      return g_host_fault ? NULL : &priv->dev;
    }

  priv->dev = g_sdiodev.dev;
  nxsem_init(&priv->waitsem, 0, 0);
  priv->timeout_reg = SDMMC_TMOUT_RESPONSE_MASK | (40000u << 8);
#else
  flags = enter_critical_section();
  if (owner >= 0 && owner != slotno)
    {
      leave_critical_section(flags);
      syslog(LOG_ERR, "SDMMC: other slot owns host; reboot to switch\n");
      return NULL;
    }

  owner = slotno;
  leave_critical_section(flags);
#endif

  priv->slot      = slotno;
  priv->cpuint    = -1;
  priv->slot_info = &g_sdmmc_slot_info[slotno];
  priv->sdio_pins = &g_sdmmc_slot_gpio_sig[slotno];

  /* Official FreeRTOS hosted host (sd_pwr_ctrl_new_on_chip_ldo): LDO_VO4
   * at 3.3 V powers the SDMMC IO rail on the P4 function-ev board
   * (CONFIG_ESP_HOSTED_SD_PWR_CTRL_LDO_IO_ID=4).  Without it, CMD52 and
   * 1-bit 400 kHz can still work, but 4-bit CMD53 fails with SBE.
   */

    {
      static bool s_sdmmc_ldo_on;
      esp_ldo_channel_handle_t ldo = NULL;
      esp_ldo_channel_config_t cfg;

      if (!s_sdmmc_ldo_on)
        {
          memset(&cfg, 0, sizeof(cfg));
          cfg.chan_id    = 4;
          cfg.voltage_mv = 3300;
          if (esp_ldo_acquire_channel(&cfg, &ldo) == 0)
            {
              s_sdmmc_ldo_on = true;
              syslog(LOG_INFO, "SDMMC: LDO_VO4 3300mV enabled\n");
            }
          else
            {
              syslog(LOG_ERR, "SDMMC: LDO_VO4 acquire failed\n");
            }
        }
    }

  /* Enable the bus clock, reset the module and set up the LS clock source
   * and phase.
   */

#ifdef CONFIG_ESP32P4_SDMMC_SHARED_POLLED
  if (!g_host_initialized)
    {
#endif
  esp32p4_sdmmc_enable_clock_reset();

  /* Reset the controller */

  priv->dev.reset(&priv->dev);

  /* Allow DMA through L2 (default SHUT_DMA=1 blocks AHB masters from
   * internal SRAM).  IDMAC is re-armed per transfer.
   */

#ifdef CONFIG_ESP32P4_SDMMC_DMA
    {
      uint32_t l2ctrl = getreg32(CACHE_L2_CACHE_CTRL_REG);

      l2ctrl &= ~CACHE_L2_CACHE_SHUT_DMA;
      putreg32(l2ctrl, CACHE_L2_CACHE_CTRL_REG);
      syslog(LOG_INFO, "SDMMC: L2_CACHE_CTRL=0x%08lx\n",
             (unsigned long)getreg32(CACHE_L2_CACHE_CTRL_REG));
    }
#endif

  sdmmc_ll_init_dma(SDMMC_LL_GET_HW(0));

  /* Keep the DesignWare global interrupt gate enabled as required by the
   * reference host initialization.  INTMASK remains zero until an upper
   * layer explicitly attaches the IRQ, so this does not route an interrupt
   * into the P4 CLIC during the polled discovery path.
   */

  regval = esp32p4_getreg(ESP32P4_SDMMC_CTRL);
  regval |= SDMMC_CTRL_INTENABLE;
  esp32p4_putreg(regval, ESP32P4_SDMMC_CTRL);

#ifdef CONFIG_ESP32P4_SDMMC_SHARED_POLLED
      sdmmc_host_set_clk_div(slotno, 4, 50);
      g_host_initialized = true;
    }

  /* No second controller/DMA reset. Each slot selects its own divider. */

  regval = esp32p4_getreg(ESP32P4_SDMMC_CLKSRC);
  regval &= ~SDMMC_CLKSRC_MASK(slotno);
  regval |= SDMMC_CLKSRC_CLKDIV(slotno, slotno);
  esp32p4_putreg(regval, ESP32P4_SDMMC_CLKSRC);
#endif

  /* Pin configuration (slot 1 is routed through the GPIO matrix).  CLK is
   * output-only; CMD and D0 are bidirectional with a pull-up.  The extra
   * data lines D1..D3 are configured by esp32p4_widebus() when 4-bit mode
   * is selected.
   */

  if (slotno == 0)
    {
      /* P4 SD1 native IO MUX function 0 (NuttX FUNCTION_1).  Slot 0
       * cannot use the slot 1 GPIO matrix signals.  V1.8 schematic
       * sheets 2/5: CLK43 CMD44 D0..D3=39..42, LDO4 IO supply.
       */

      esp_configgpio(43, OUTPUT | DRIVE_3 | FUNCTION_1);
      esp_configgpio(44, INPUT | OUTPUT | PULLUP | DRIVE_3 | FUNCTION_1);
      esp_configgpio(39, INPUT | OUTPUT | PULLUP | DRIVE_3 | FUNCTION_1);
      esp_configgpio(40, INPUT | PULLUP);
      esp_configgpio(41, INPUT | PULLUP);
      esp_gpiowrite(42, true);
      esp_gpio_matrix_out(42, SIG_GPIO_OUT_IDX, false, false);
      esp_configgpio(42, OUTPUT | PULLUP | DRIVE_3);
    }
  else
    {
      configure_pin(CONFIG_ESP32P4_SDMMC_CLK, priv->sdio_pins->clk, OUTPUT);
      configure_pin(CONFIG_ESP32P4_SDMMC_CMD, priv->sdio_pins->cmd,
                    INPUT | OUTPUT | PULLUP);
      configure_pin(CONFIG_ESP32P4_SDMMC_D0, priv->sdio_pins->d0,
                    INPUT | OUTPUT | PULLUP);
      configure_pin(CONFIG_ESP32P4_SDMMC_D1, priv->sdio_pins->d1,
                    INPUT | OUTPUT | PULLUP);
      configure_pin(CONFIG_ESP32P4_SDMMC_D2, priv->sdio_pins->d2,
                    INPUT | OUTPUT | PULLUP);

