uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_sdmmc.c
      /* DAT3 high at CMD0 prevents accidental SPI mode selection. */

      esp_gpiowrite(CONFIG_ESP32P4_SDMMC_D3, true);
      esp_gpio_matrix_out(CONFIG_ESP32P4_SDMMC_D3, SIG_GPIO_OUT_IDX,
                          false, false);
      esp_configgpio(CONFIG_ESP32P4_SDMMC_D3, OUTPUT | PULLUP | DRIVE_3);
    }

  /* Tie the card-interrupt input high (inactive), card-detect low (card
   * present -- the C6 is hard-wired) and write-protect inactive, all
   * through GPIO-matrix constant inputs.
   */

  esp_gpio_matrix_in(GPIO_MATRIX_CONST_ONE_INPUT,
                     priv->slot_info->card_int, false);
  esp_gpio_matrix_in(GPIO_MATRIX_CONST_ZERO_INPUT,
                     priv->slot_info->card_detect, false);
  esp_gpio_matrix_in(GPIO_MATRIX_CONST_ONE_INPUT,
                     priv->slot_info->write_protect, true);

#ifdef CONFIG_ESP32P4_SDMMC_SHARED_POLLED
  g_slot_initialized[slotno] = true;
  nxrmutex_unlock(&g_host_lock);
#endif
  return &priv->dev;
}

/****************************************************************************
 * Name: esp32p4_sdmmc_set_sample_phase
 ****************************************************************************/

void esp32p4_sdmmc_set_sample_phase(unsigned int phase)
{
  irqstate_t flags;
  uint32_t regval;

#ifdef CONFIG_ESP32P4_SDMMC_SHARED_POLLED
  /* Global phase retuning is deliberately excluded from shared mode. */

  syslog(LOG_ERR, "SDMMC shared: sample-phase retuning refused\n");
  return;
#endif

  phase &= 3u;

  flags = enter_critical_section();
  regval = esp32p4_getreg(ESP32P4_HP_SYS_CLKRST_PERI_CLK_CTRL02);
  regval &= ~HP_SYS_CLKRST_SDIO_LS_SAM_EDGE_SEL_M;
  regval |= (phase << HP_SYS_CLKRST_SDIO_LS_SAM_EDGE_SEL_S) &
            HP_SYS_CLKRST_SDIO_LS_SAM_EDGE_SEL_M;
  regval |= HP_SYS_CLKRST_SDIO_LS_SAM_CLK_EN;
  esp32p4_putreg(regval, ESP32P4_HP_SYS_CLKRST_PERI_CLK_CTRL02);

  regval |= HP_SYS_CLKRST_SDIO_LS_CLK_EDGE_UPD;
  esp32p4_putreg(regval, ESP32P4_HP_SYS_CLKRST_PERI_CLK_CTRL02);
  regval &= ~HP_SYS_CLKRST_SDIO_LS_CLK_EDGE_UPD;
  esp32p4_putreg(regval, ESP32P4_HP_SYS_CLKRST_PERI_CLK_CTRL02);
  leave_critical_section(flags);

  up_udelay(10);
  syslog(LOG_INFO, "SDMMC: sample phase %u\n", phase);
}

#endif /* CONFIG_ESP32P4_SDMMC */
